{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-42875578232038246396385200536402794643456",
          "metadata": {
            "name": "GPKenya: Where revival meets regeneration for Earth’s rebirth.",
            "description": " Our initiative is tackling two interconnected challenges: environmental degradation (specifically soil health and deforestation) and limited access to education/collaboration in regenerative practices and web3 technologies. \nBy combining ecological restoration with community-driven innovation, we aim to create a sustainable, circular model that benefits both ecosystems and local communities.  \n\nKey Projects & Progress  \n1. Regen Tourist Hub / Co-Working Spaces  \n   -Problem Addressed: Fragmented knowledge-sharing and lack of physical spaces for collaboration in regenerative agriculture and web3 ecosystems.  \n   - Solution: We are establishing a hub in Kenya to host workshops, attract global web3 leaders (e.g., Celo, Vitalik Buterin), and foster partnerships.  \n   -Progress: Hosted 5 events (150+ attendees), positioning Kenya as a nexus for regenerative and web3 innovation.  \n\n2. Organic Fertilizer Production  \n   -Problem Addressed: Reliance on synthetic fertilizers and poor soil health in agriculture.  \n   -Solution: Scaling compost/biochar production (5+ tonnes made) to replace chemicals, improve soil, and reduce waste. Direct supply to our regenerative farming initiatives.\n\n3. Regenerative Farming & Tree Planting \n   -Problem Addressed: Deforestation and unsustainable farming practices.  \n   -Solution: Planting 100+ trees using organic fertilizer, creating a closed-loop system (fertilizer → crops → carbon sequestration).  \n\nImpact & Synergies\n-Environmental: Improved soil health, carbon capture via trees, and reduced chemical use.  \n-Community: Educated 150+ participants on web3/regeneration, fostering Kenya’s role as a global hub.  \n-Economic: Revenue from the Regen Hub and fertilizer sales aim to sustain operations long-term.  \n\nOverall Vision:\n  A self-sustaining ecosystem where regenerative agriculture, web3 innovation, and community education reinforce each other to combat climate change and economic inequity\""
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744124037",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://docs.google.com/document/d/1HM-gL_SxNaK_iJyzRbVgWeYrV-ujmEgbm3g8MSDBDXk/edit?tab=t.0\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "42875578232038246396385200536402794643456",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "c3254072-800f-4046-b794-018ad16e9bcd"
              }
            ]
          }
        }
      ]
    }
  }
}