{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-59889696578085169569553930907991205216256",
          "metadata": {
            "name": "Kendir Regenerative Hemp Cultivation",
            "description": "The Kendir Hemp Cultivation project in Türkiye is a regenerative farming initiative aimed at restoring soil health, biodiversity, and traditional agricultural knowledge. \nFrom April 4 to September 28, 2024, we cultivated 41,6 decares of heirloom hemp through a collaborative effort involving over 15 local community members. This effort produced 43 tons of hemp stalks and 3,000+ kg of seeds while supporting ecological balance and local livelihoods.\n\nThis work revives Kendir (Cannabis sativa L.), a forgotten yet highly versatile plant with deep cultural roots. Historically marginalized for over a century, hemp is now being reintroduced to support modern industries including textiles, food, construction, paper, and bio-packaging.\n\nOur cultivation process began with regenerative soil preparation: compost, mycorrhizae, and organic manure, alongside heirloom seeds selected for their adaptability. Planting followed precise spacing and depth guidelines, with irrigation handled through careful sprinkler use. Manual weeding maintained soil structure and team engagement.\n\nTo enhance biodiversity, we integrated over 100 beehives into the hemp fields. These supported a thriving pollinator ecosystem and even resulted in cannabis honey; a rare and valuable product of agroecological synergy.\n\nKey Impacts:\n- Empowered and employed local farmers\n- Revived heirloom hemp and traditional knowledge\n- Enriched soil fertility through biological amendments\n- Boosted biodiversity with heirloom seeds and beehives\n- Contributed raw material to regenerative industry value chains\n\nLooking ahead, we plan to expand to new lands in 2025, scaling our impact and deepening our commitment to a regenerative future."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x5076f87610Ff3D5f859d562a050Dae82F6b3C63e",
                "creation_block_timestamp": "1746770463",
                "data": {
                  "title": "VERIFIED REGENERATIVE ACTION",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://bloomnetwork.earth/view/kendir-hemp-harvest--a-cade229788fd\",\"description\":\"Bloom Network Report\"}",
                    "{\"type\":\"url\",\"src\":\"https://daodao.zone/dao/juno1vg9hpfyxn6dps0nx7v0064msgrrwakmjgf3dh7fa8ldzue6anxms964vct/proposals/A12\",\"description\":\"DAO Confirmation for Plantation A-1\"}",
                    "{\"type\":\"url\",\"src\":\"https://daodao.zone/dao/juno1vg9hpfyxn6dps0nx7v0064msgrrwakmjgf3dh7fa8ldzue6anxms964vct/proposals/A13\",\"description\":\"DAO Confirmation for Plantation B-2\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "59889696578085169569553930907991205216256",
                  "description": "Regenerative hemp harvest using heirloom seeds, organic amendments, manual care, and integrated beekeeping—part of the full 2024 Kendir cultivation cycle.\n\n\n\n\n\n\n\n",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "05f7e828-4e19-4dd4-96ad-a9412c9330c0"
              }
            ]
          }
        }
      ]
    }
  }
}