{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-56827155275796723398383559441105291313152",
          "metadata": {
            "name": "Refi Uganda:- Community led Mangrove Reforestation in Northern Uganda",
            "description": "Refi Uganda: Community-led Mangrove Reforestation in Northern Uganda Refi Uganda, is implementing a grassroots-driven mangrove reforestation project aimed at restoring degraded coastal ecosystems in Northern Uganda. The initiative supports two local community groups—Orum and Abyecce—to lead the planting and care of mangrove seedlings in ecologically vulnerable creek zones. The project combines environmental restoration with livelihood creation by training and employing community members in mangrove nursery management, planting, and conservation education. In 2023, the program successfully planted 54,400 mangrove trees, laying the foundation for long-term ecosystem recovery and sustainable economic opportunities. The 2025 planting season will scale these efforts, improve seedling survival through enhanced nursery practices, and introduce monitoring systems to ensure ecological impact. The project empowers local communities as stewards of their environment, contributing to biodiversity conservation, climate resilience, and inclusive development."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744126775",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/u/2/folders/1sMykmF4ApgQ_l5XzuzmSGpA9szY4chbW\"}",
                    "{\"type\":\"url\",\"src\":\"https://refi-dao.notion.site/Refi-Uganda-1d9ba221ab5d488f87e67dc7217c1f2c\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "56827155275796723398383559441105291313152",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "6d8e90ff-7a6f-4632-992c-0858e5cfee53"
              }
            ]
          }
        }
      ]
    }
  }
}