{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-51722919771982646446432940329628768141312",
          "metadata": {
            "name": "ReFi Lagos: Project OSISI ",
            "description": "Project OSISI is a ReFi Lagos ecosystem project connecting impact donors to tree-planting events in Nigeria. OSISI Pilot Farm is a 1040-SQM tree nursing garden in Badagry town, Lagos State. It serves as a hub for nursing and distribution of tree seedlings \n\nBy establishing this pilot garden, we've gained valuable insights into several key aspects of the tree nursing business:\n1) Unit Cost Analysis: Understanding the cost of producing tree seedlings is crucial for scaling up tree planting efforts and creating sustainable environmental programs. \n2) Distribution Methods: The pilot has allowed us to test and refine strategies for distributing planting materials and tree seedlings, which can inform future tree planting festivals\n\nCommunity Involvement: Project OSISI enables land stewards to organize tree-planting events in schools and climate-affected communities in Nigeria. OSISI works with coconut farmers in Badagry, empowering them to grow and sell tree seedlings. \n\nScale and Impact: The OSISI Pilot farm employs 3 farmers to nurse tree seedlings. The farm has successfully grown 100 tree seedlings ready to be transplanted.\n\nActivities & Approach: We take pride in our mutual partnership with NGOs and governments. Project OSISI recently secured the approval of Lagos State Government Education Districts to implement tree-planting festivals in 8 schools in Lagos. \n\nQuantifiable Result: OSISI pilot farm sits on a 1040 SQM farmland where we grow tree seedlings and banana/plantain fruits. Project OSISI has planted over 200 trees in schools, recreational parks, and coastal communities in Nigeria\n"
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744124961",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://docs.google.com/document/d/1X6_lOVv9FuXELViUp9S4Btg7A_7E1zWI-K6hzcXFZ54/edit?tab=t.0\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "51722919771982646446432940329628768141312",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "4c3d34de-9af1-4462-8edc-96a40fb4ffbf"
              }
            ]
          }
        }
      ]
    }
  }
}