{
  "data": {
    "hypercerts": {
      "count": 2,
      "data": [
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-15974895997470377105751584320491790455013376",
          "metadata": {
            "name": "GreenPill Ottawa",
            "description": "This is a summary of the work completed for GreenPill Ottawa from April '23 - Oct '23. We hosted 3 hands-on educational workshops, one of which included having participants set up their first wallet where they received ETH as a reward for doing so. We have started the process of launching a rooftop garden in our city. We created an on-boarding guide with step-by-step instructions on how to get started in web3, and educating them on projects such as Gitcoin and Optimism. We hosted 2 large-scale community meetups in partnership with PizzaDAO, including an official side event for Eth Waterloo. We made a donation to Ecology Ottawa, an organization dedicated to tree planting within our local area. We wrote the 'Touch Grass' guide for the GreenPill V2. We are running the GreenPill Network lens account where we are experimenting with raising funds to support projects like GP Nigeria. We are also creating the newsletter and recap mirror posts for GreenPill State of the Network. "
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18526673467010494643263430501622620272721920",
          "metadata": {
            "name": "GreenPill Ottawa x RootedLABs ",
            "description": "Creating open-source urban-focused agriculture solutions that support the environment while feeding our communities.\n\n​​Rooted LABs is dedicated to tackling the urgent issues of food insecurity and climate change, advocating for innovative and inclusive solutions that unite technology and communities, break down resource barriers, and promote open-source principles to enhance global agriculture.\n\nThe problem:\n\nThe world’s population has more than doubled over the past 50 years. This alone has caused immense stress on the natural environment and as a result, we are experiencing soil degradation, depletions of groundwater, pollution, ocean acidification, accelerated rates of extinction, global warming, droughts, diseases, high concentrations of CO 2 and mass deforestation. In a time of increasing population growth, climate change and environmental degradation, we need agricultural systems that come with a more balanced portfolio of sustainability benefits. \n\nA path forward : \n\nUrban agriculture has been defined as “reconnecting with the community through food, jobs and economic development” and is a sustainable solution. \n\nWe’re testing technology, creating and maintaining urban farms starting in Ottawa, Canada's capital city, donating fresh produce to community centers, and reshaping the way we approach environmentally friendly food production while also mentoring the next generation of leaders. \n\nThe project would be entirely open-sourced, and start a workforce who could move on and create their own advanced agricultural businesses in other cities globally.\n\nWhat does this look like? Our Vision and Objectives:\n\nDevelop a Sustainable and Technologically Advanced Urban Farm:\n\n- Action: Acquire a disused shipping container in downtown Ottawa and partner with The Growcer (https://www.thegrowcer.ca) to repurpose it as a smart urban farm.\n\n- Action: Collaborate with technology and agriculture companies specializing in urban farming, automation, and renewable energy solutions to equip the shipping container with the latest sustainable farming technologies, such as hydroponics, LED lighting, and efficient climate control systems.\n\n- Action: Create a rooftop garden in the downtown core. This not only produces fresh food but can reduce greenhouse gas emissions and support our city in hitting its climate action goals.  \n\n- Outcome: The repurposed shipping container in downtown Ottawa becomes a state-of-the-art urban farm, producing a variety of fresh produce year-round and serving as a model for sustainable urban agriculture.\n\nThis started out as a project idea within the Ottawa GreenPill chapter (we met at a web3 education workshop hosted by GPN Ottawa).\n\nThis project falls under the umbrella of Ottawa GreenPill, however, we've chosen the name Rooted LABs to help us work closer with our local municipality and provincial government, as well as Tech companies in our community.\n\nIn the last few months, we at Rooted LABs have...\n\n- donated to Ecology Ottawa, a local tree-planting organization.\n\n- Hosted 2 climate-focused regenerative workshops.\n\n- Researched and built out the following Roof Top/urban garden roadmap - https://bafybeielssaoda27edlmvilepur4j3bti5xiv3ixtkkvrwlq5e44ag567i.ipfs.nftstorage.link/\n\n- We have set up meetings with local tech and AI businesses, including Growcer(www.thegrowcer.ca) to explore collaborating on this project.\n\n- Built out a small core team of volunteers to help grow this project. \n\nWe are seeking funding support to help take our project from a small start-up idea, into a fast-moving open-source agricultural project.\n\n\n"
          },
          "attestations": {
            "data": []
          }
        }
      ]
    }
  }
}