{
  "data": {
    "hypercerts": {
      "count": 4,
      "data": [
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18148619757361332010355621312765925789794304",
          "metadata": {
            "name": "Rifai Sicilia",
            "description": "Rifai Sicilia is a 5 day immersive event in Regenerative Finance, regional economic design, and implementation, taking place during the olive harvest in October 2023 on Sicily's west side. The project will provide support for transitioning to syntropic agroforestry, while also coordinating bioregional economies, digitally mapping the territory, and more."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18649175119102032490110245360298056828846080",
          "metadata": {
            "name": "Rifai Sicilia",
            "description": "Rifai Sicilia empowers communities to participate in on-chain regenerative finance to catalyze a bioregional economy by connecting people, projects, and places. \n\nRifai Sicilia is a cultural interpretation of Regenerative Finance “ReFi”. Rifai in Italian means “Do Over” and offers an alternative path for cultural and ecological regeneration."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18650536248569716243964098858727783901691904",
          "metadata": {
            "name": "Rifai Sicilia GG19",
            "description": "Who We Are\nRifai Sicilia empowers communities to participate in on-chain regenerative finance and catalyzes a bioregional economy by connecting people, projects, and places. Rifai Sicilia is a cultural interpretation of Regenerative Finance “ReFi”. Rifai in Italian means “Do Over” and offers an alternative path for cultural and ecological regeneration.\n\nWhat We Do\nThe previous round of gitcoin donations helped us host a weeklong ReFi event where we\n\n-Planted 400 moringa trees that will provide super nutritious food for humans, biomass for soil, and habitat for animals and insects. \n-Kickstarted the foundation of a syntropic Agroforestry food forest and incepted it's title, \"Butterfly Hill\".\n-Made over 500 seed balls with native species\n-Held activities at 6 different locations around the bioregion.\n-Used dMRV platform Silvi Protocol to log the planted trees using smart phones and drone imagery.\n-Created an agroforestry ecocredit with Sunflower Ecotech \n-Writing a library of Italian language regenerative finance and permaculture educational content. \n\nIn the past 6 months, we have onboarded over 60 people with wallets and have issued over 120 NFT tickets on Mego.cx for participating in mutual aid events from tree plantings to beach cleanups. See the onchain community activity here https://dune.com/turinglabsorg/rifai-sicilia \n\nYour donations will help \n-Support the growth of the syntropic agroforestry school at Butterfly Hill to restore 3 hectares of degraded land into a thriving food forest through continued education for local farmers.\n-Seed the bioregional regeneration fund to support local projects in more parts of the island.\n-Continued online and offline events and education for web3 onboarding in Italian and English.\n-Improve the rifaisicilia.com website to add more features to serve the community better.\n\nOnline Events- Bioregional Mapping Session https://www.youtube.com/watch?v=jKcCon6PPAg\n\nParticipant Testimonials\n\n“Rifai Sicilia balanced the real life intersection of agroecological practise and ReFi onboarding and dMRV use into an awesome, wholesome and spirited event.” Hereward McGillivray\n\n\"We came together and did the thing! This was one of the first events where it really felt like we made a tangible impact, actually regenerating land instead of coming together to talk about it! It was also a catalyst for refining our Agroforestry Stewardship Methodology. Definitely a highlight of the year 🌻💚🙌🌱\" - Sev Nightingale \n\n“Thank you so much for everything! This has been a life changing experience. It’s incredible what you’re creating & I’m so grateful to be part of it 🙏🏻” - Eve M.\n\nThank you to our Partners\n\nMego Tickets mego.cx\n\nSunflower Ecotech sunflowereco.tech\n\nSilvi Protocol silvi.earth\n\nLiminal Village liminalvillage.com\n\nAgromini.org\n\nCryptoshields https://cryptoshields.consulting/\n\nClub Sankara https://www.facebook.com/ClubSankara/\n\nLiberating Structures https://gospelofchange.com/\n\nOasi Maker https://www.facebook.com/oasimaker\n\nSole Languages https://solelanguages.com/\n\nFollow the Leaf https://followtheleaf.org/\n\nButterfly Hill Agroforestry Farm\n\nReFii Italia https://twitter.com/ReFi_Italia\n\n\n\n\n"
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-34708801425935723273264209958040357568512",
          "metadata": {
            "name": "Rifai Sicilia Tree Planting 2024",
            "description": "Over 500 tree plantings and survivability checks across the whole of Sicily Island led by @RifaiSicilia with MRV by @SilviProtocol across multiple planting events, locations and farms.\n\nProceeds from this Hypercert will be distributed retroactively to stewards who have contributed to the MRV events of this Hypercert and will represent a sponsorship of impact. There is no transfer of ownership associated to impact unless otherwise agreed.\n\nThe impact report might include trees before or after the 2024 window due to how the impact is queried. Some trees might have died and continued updates on the project can be found at app.silvi.earth"
          },
          "attestations": {
            "data": []
          }
        }
      ]
    }
  }
}