{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-44917272433563877177165448180993403912192",
          "metadata": {
            "name": "Tamagochi at Riverside",
            "description": "Project Title: Tamagochi at Riverside \nTimeline: March 2023 – December 2023 \nLocation: Huangxi River Corridor, Tianmu District, Taipei City, Taiwan\n\nSummary and Quantifiable results : \nThis project combines environmental education with Web3 tools to reconnect urban residents with the Huangxi River(Formal name: Southern Sulfur creek) in Taipei. In partnership with Formosa Art Bank DAO (FAB DAO), the Huangxi Environmental Education Programme (HEEP) engaged over 3,000 students and parents at Mingde Elementary School through a hands-on river corridor challenge and interactive NFT-based learning tools. Participants earned “Stream Guardian” badges and NFTs—such as a digital White-breasted Waterhen—by completing ecological missions, sparking curiosity and awareness of riparian biodiversity.\n\nBeyond the school, the project reached over 50,000 local residents and connected with 20+ online and offline communities through workshops, digital campaigns, and habitat restoration events.  It contributes to build public-private collatoration on watershed governace.Over 300 NFTs were issued as proof of participation (POAP)and engagement, tracking involvement and supporting long-term community stewardship.\nIn two pilot zones along the Huangxi, reduced dredging and vegetation removal allowed native species to return, and natural habitat to restore—monitored in part by students and community volunteers. This project demonstrates how combining civic action, education, and digital tools can restore ecological relationships and encourage sustainable urban watershed governance.\n\nTamagochi at Riverside NFT: https://akaswap.com/akaobj/14470\nHeart of the River Corridor POAP: https://akaswap.com/akaobj/14471"
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744123586",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/folders/1OXgtcFSb46AR2ktN9Dq2R3CYoUXnr_Td\"}",
                    "{\"type\":\"url\",\"src\":\"https://akaswap.com/akaobj/14470\"}",
                    "{\"type\":\"url\",\"src\":\"https://akaswap.com/akaobj/14471\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "44917272433563877177165448180993403912192",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "517e8253-1bba-4478-b640-8046a6964a01"
              }
            ]
          }
        }
      ]
    }
  }
}