{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-54104896340429215690676562581651145621504",
          "metadata": {
            "name": "Rio Sagrado AI Avatar",
            "description": "The Rio Sagrado Avatar is a digital-physical embodiment of the Rio Sagrado in Morretes, Paraná (Brazil). It serves both educational and political purposes by giving voice to a threatened river within one of the world’s most biodiverse biomes—the Atlantic RainForest.\n\nThe 21km river carries cultural and historical importance, having once provided refuge for fleeing slaves and lending its name to a major neighborhood. Today, it faces grave risks from an international railroad project that threatens to destroy over 100 water springs in the region. In response, the local community is mobilizing to defend the river, advocating for its recognition as a legal entity with rights. \n\nTo amplify this movement, the AI Avatar was co-created as a symbolic and functional spokesperson for the river. It includes a handcrafted sculpture by a local artisan, an AI interface trained on scientific and cultural knowledge about the watershed, and a system of environmental sensors for real-time monitoring of water quality. Accessible via web and WhatsApp, the AI Avatar allows the river to “speak” and share its story. It not only engages the public but also supports legal and policy advocacy efforts. As such, it has sparked broader initiatives aimed at fostering an understanding of the Rio Sagrado as a living entity with legal rights, including a community-led short film and original song and the draft of a Rights of Nature bill to be presented to the municipality's government.\n\nFurthermore, the project sparked a partnership with the MAPAS ONG towards a campaign to fund new AI Avatars for legally recognized ecosystems across Brazil."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744125564",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://sympoiesis.xyz/rio-sagrado/\"}",
                    "{\"type\":\"url\",\"src\":\"https://api.whatsapp.com/send/?phone=%2B554196638496&text&type=phone_number&app_absent=0\"}",
                    "{\"type\":\"url\",\"src\":\"https://sympoiesis.xyz/api/biodata/iot/\"}",
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/u/0/folders/17p2VsvRPQXguAiq3jHB3TbiFdzNLtGcc\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "54104896340429215690676562581651145621504",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round. The data includes links to talk to the Avatar right now via a web-interface or via WhatsApp. There is also a link where you can monitor the live data from the sensors in the Rio Sagrado's waters.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "425e10df-bfcd-4415-87fa-8da9797ccc83"
              }
            ]
          }
        }
      ]
    }
  }
}