{
  "data": {
    "hypercerts": {
      "count": 3,
      "data": [
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-145981135409082600825787706588228562714624",
          "metadata": {
            "name": "Bloom Network Gitcoin Alpha",
            "description": "🌍 Bloom is a cyber-physical social network that helps people find and participate in grassroots climate actions where they live. https://bloomnetwork.earth\n\nToday, we are 30,000 people on the ground in 22 local Bloom hubs across 9 countries doing rapid climate repair and adaptation.\n\nLocal Bloom hubs connect existing projects in their region. They plant community gardens, teach people to form agroforestry co-ops, and build regional token economies focused on land and water stewardship. Online, we share knowledge P2P as a global community to implement climate repair more quickly and cost-effectively."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18019312457931375394239538961941853869441024",
          "metadata": {
            "name": "Bloom Network 2023 Impact",
            "description": "2400 more students trained in Permaculture in Uganda, 110 natural infrastructure in dryland streams for watershed restoration in Texas, phytoremediation of lead in urban land plots + mycological community in Baltimore, 60+ users of our new social network, completed smart contracts for Regenerative Action Rewards protocol, social network live in production!"
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18085327237114037456151433635783616902463488",
          "metadata": {
            "name": "Bloom Network",
            "description": "Bloom Network is a cyber-physical social network that connects people to grassroots climate actions in their local communities, and rewards them for their impact."
          },
          "attestations": {
            "data": []
          }
        }
      ]
    }
  }
}