{
  "id": "42220-31-0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb",
  "projectId": "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb",
  "projectUIDs": [
    "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
    "0x2437fbc2e4ca95d77f11f893cdf8b5ef856bab25ac359d4628e79c66b896a1fd"
  ],
  "grants": [
    {
      "_id": {
        "$oid": "67d73aac98a3199d0843d624"
      },
      "uid": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
      "schemaUID": "0x7afa603a89cee2d8f93d30007e2c64efddc6509fd76aa95d2ccd97b6e34acc71",
      "refUID": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
      "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "revoked": false,
      "revocationTime": 0,
      "createdAt": "2025-03-16T20:54:53.000Z",
      "updatedAt": "2025-03-16T20:55:08.000Z",
      "chainID": 42220,
      "type": "Grant",
      "data": {
        "communityUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d"
      },
      "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
      "external": {
        "gitcoin": [
          "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb"
        ]
      },
      "details": {
        "_id": {
          "$oid": "67fecb25d9c7b759f217dd68"
        },
        "uid": "0x5bc88b78e098af1ad53b0c6808160bc3071c1dd6aa39fd50b2a342d642bf50ed",
        "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
        "refUID": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
        "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1744751390,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1744751397,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "GrantDetails",
        "data": {
          "title": "BioFi Pathfinders 🌱",
          "description": "The Bioregional Finance (BioFi) Pathfinders Round is a partnership between The BioFi Project, Open Civics, The Design School for Regenerating Earth, and Regen Coordination to support the most sophisticated Bioregional Organizing Teams around the world in developing, clarifying, and enhancing their BioFi vision, strategy, and capabilities. This invite-only round is aimed at advanced teams that are already practicing or actively developing their approach to Bioregional Finance (BioFi), with a focus on building Bioregional Financing Facilities (BFFs) or bioregional funding ecosystems more broadly. For detailed suggested questions to help shape your project description, visit https://nifty-humidity-dcf.notion.site/Pathfinders-Grantee-Questions-Template-fa60a0314b174422bd1f2735e3541cdc?pvs=4\n\n🌀 Gitcoin Grant Reporting Story – Regenerate Cascadia & the Department of Bioregion\nWe are rooted in the Cascadia bioregion, a land and sea mosaic stretching from the Pacific Ocean to the Continental Divide, and from Southeast Alaska through British Columbia, Washington, Oregon, and into parts of Northern California and Idaho. This place is defined not by lines on a map, but by the living systems that shape it—salmon-bearing watersheds, coastal rainforests, fire-adapted mountain ranges, and the people who are in relationship with them. Our shared identity is shaped by the rhythms of water and forest, food and fire, migration and culture.\n\nThe Department of Bioregion has spent more than a decade mapping Cascadia through both scientific and cultural lenses—hydrology, ecology, language, Indigenous territories, community feedback, and systems awareness. We don’t see mapping as a static process, but as a living conversation: a collective act of reclaiming and remembering how we are embedded in place. More than 100 maps and resources have been collaboratively created, always rooted in the understanding that bioregions are not just ecological units—they are cultural, economic, and political possibilities.\n\nCascadia faces deep, systemic challenges: ecological degradation from industrial extraction, housing crises and colonial land ownership patterns, siloed governance, and a disconnection between urban centers and rural, Indigenous, and working communities. But we also feel we are approaching a tipping point. A new generation is hungry for alternatives. From Indigenous land rematriation to community-owned energy and cooperative food systems, seeds of a regenerative bioregional economy are already germinating. The vision is not about scaling up, but about deepening down—networks of community-led, place-based resilience that are interconnected across watersheds and eco-cultural corridors.\n\nOur bioregional organizing effort began informally—as a coalition of mappers, artists, community organizers, land stewards, and decentralized tech builders. Today, through Regenerate Cascadia, we’re evolving into a more formal constellation of weavers, nodes, and affinity groups. Our “team” is distributed and emergent, guided by a deep commitment to polycentric, non-hierarchical governance and distributed leadership. We hold convenings, co-create visioning tools, publish educational materials, and serve as connective tissue between existing movements.\n\nRight now, we’re serving as a backbone support for bioregional convergence efforts, supporting local hubs, and facilitating participatory design for what comes next. Our work includes co-developing shared tools for bioregional mapping, coordinating mutual aid and resilience networks, exploring cooperative financing infrastructure, and supporting aligned projects across the region. Our future vision includes hosting watershed assemblies, building open-source Bioregional Funding Frameworks (BFFs), and helping transition land, capital, and governance to steward communities.\n\nEngagement with Indigenous Peoples and wisdom traditions is essential to our work. We do not claim to represent any Indigenous nation, but we acknowledge that Cascadia exists entirely on Indigenous lands, and our vision of regeneration is impossible without Indigenous sovereignty and leadership. We are in ongoing relationship-building, listening, and learning—especially around traditional ecological knowledge, ceremony, and governance models that offer deep guidance for decentralized, place-based systems. We are committed to creating space for these voices to lead the bioregional story, and to supporting land back and cultural resurgence efforts whenever possible.\n\nWe are still in the early stages of crafting a shared landscape vision, but significant momentum is growing. Through the Regenerate Cascadia process, more than 50 local convergence events have been held across the bioregion since 2023, creating a rich web of partnerships—with food sovereignty orgs, eco-villages, climate justice groups, regenerative finance practitioners, and more. We are now coalescing around a collective strategy grounded in shared values and mutual support.\n\nWhen it comes to money, we’ve mostly been scrappy and decentralized—funding this work through small grants, mutual aid, and volunteer effort. The Gitcoin round has been a huge catalyst, helping us prototype collective resourcing strategies. Money often flows in fragmented, competitive, and opaque ways here, reinforcing scarcity. We want to change that. Our dream is a bioregional funding ecosystem—a transparent, participatory, and solidarity-based commons where capital flows toward community-defined priorities.\n\nWe envision Bioregional Funding Frameworks (BFFs) that enable decentralized grantmaking, cooperative ownership, open accounting, and community-governed trusts. These mechanisms should be adaptive, transparent, and deeply place-based—tools to help us resource what regeneration feels like in each unique watershed. The biggest obstacles? Legal and technical infrastructure, organizational capacity, and overcoming the legacy of extractive systems. We need support navigating incorporation, compliance, participatory budgeting tools, and storytelling to share our vision widely.\n\nWe’ve learned that trust, relationships, and shared language are far more valuable than any single financial tool. We’ve also learned that trying to “scale up” too quickly—without deep local grounding—can cause fragmentation. Our biggest questions include: How do we move from convening to co-governance? How do we redistribute power, not just resources? How do we honor cultural complexity without diluting vision?\n\nWe’re using Gitcoin funds to deepen these explorations: hosting strategy gatherings, piloting cooperative funding tools, developing educational resources, and designing structures for long-term stewardship. This includes creating materials for fundraising and public engagement, supporting regional nodes, and laying the groundwork for a participatory bioregional governance model.\n\nThis is not just about Cascadia. It's about creating a replicable model that others can adapt to their own bioregions. Together, we are remembering how to live in right relationship—with land, with each other, and with the future.",
          "payoutAddress": "0xa1cE98594e6844d850Db9Db9FE01b9595D445ca4",
          "type": "grant-details",
          "amount": "",
          "linkToProposal": "",
          "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "community": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "proposalURL": ""
        },
        "txid": "0x5137fd7cb591cbaeef16e59d1712828cb34340bc0bf43ff732068ed440b884c5"
      },
      "project": {
        "_id": {
          "$oid": "67d73aab98a3199d0843d622"
        },
        "uid": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
        "schemaUID": "0xf3f753b41e04d1052b5a5ec7624d1dfdb6c2da288a985120e477ddbcac071022",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1742158493,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1742158507,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Project",
        "data": {
          "project": true
        },
        "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
        "categories": [
          {
            "_id": {
              "$oid": "682b32c8a94ec324b2d06b6a"
            },
            "name": "BioFi"
          }
        ]
      },
      "categories": [
        "BioFi"
      ],
      "milestones": [],
      "updates": [
        {
          "_id": {
            "$oid": "67d73aad98a3199d0843d629"
          },
          "uid": "0xc6d3d99c17514ec4e1c34c429eca0e6a89a0a5b5866fda3e0a657ae87c818328",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1742158493,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1742158509,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "GrantUpdate",
          "data": {
            "text": "Updates can be found here: undefined",
            "type": "grant-update",
            "title": ""
          },
          "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1"
        }
      ],
      "community": {
        "_id": {
          "$oid": "66e9e763ab96b4dace0e1a6b"
        },
        "uid": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
        "schemaUID": "0x3c2231024f4f17f3718b5bd9ed9ff29cc323dea5449f9ceba11a9888bfbdd0e1",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23B7A53ecfd93803C63b97316D7362eae59C55B6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1726605143,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1726605155,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Community",
        "data": {
          "community": true
        },
        "txid": "0xa6c51590c94ef8701cf2c5e7db62719abf68bda8ca8addc01ddbc5b9ea109313",
        "externalIds": [],
        "details": {
          "_id": {
            "$oid": "67f408946917f7b508a52ca0"
          },
          "uid": "0x66854f6787285a5fb553eb56d4b55f8b00a3767e13da6e1ca614b5ae394661c7",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x0000000000000000000000000000000000000000",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744046222,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744046228,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "CommunityDetails",
          "data": {
            "name": "Regen Coordination",
            "description": "The Regen Coordination Round is a proposal for a GG21 community round centered on the themes of Coordi-nations 3, Cosmo-localism 2, Bio-Regionalism 3, and Regenerative Finance (ReFi) 3. Bringing together GreenPill Network 1, ReFi DAO 1, Celo Regional DAOs 1 and Regens Unite 1, we aim to support a global movement of regenerative communities leveraging Web3 for real-world impact and addressing local needs. The round will feed into a program to support the further development of local community impact tracking methodologies, grant tooling interoperability, and integrated QF & RPGF. We have currently secured $60K in funding from Celo Public Goods, ReFi DAO and Greenpill and ask for Gitcoin’s backing as we embark on a shared mission to showcase how community coordination, Web3, and innovative financial mechanisms can enable ecological and social regeneration on a global scale.",
            "imageURL": "https://s3.us-east-1.amazonaws.com/showkarma.xyz/assets/karma-regen-coordination.png",
            "slug": "regen-coordination"
          },
          "txid": "0xfa63385f4be189fabdd1f77c9fb54f5dbc9a1728802c0675e3e45c0c5fb83e74"
        }
      }
    },
    {
      "_id": {
        "$oid": "67edb6fb38e5aedb69e8c4e7"
      },
      "uid": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
      "schemaUID": "0x7afa603a89cee2d8f93d30007e2c64efddc6509fd76aa95d2ccd97b6e34acc71",
      "refUID": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
      "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
      "revoked": false,
      "revocationTime": 0,
      "createdAt": "2025-04-02T22:15:20.000Z",
      "updatedAt": "2025-04-02T22:15:23.000Z",
      "chainID": 42220,
      "type": "Grant",
      "data": {
        "communityUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d"
      },
      "txid": "0x6db63b8432d6714cc70cf4e62bee89590b1a0161264ca37544016f7118a02c93",
      "external": {
        "gitcoin": [
          "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb"
        ]
      },
      "details": {
        "_id": {
          "$oid": "67edb6fb38e5aedb69e8c4e8"
        },
        "uid": "0x6e045280df4adaf3c35f0ce2115508c56c12dad6a922ee81a9a729fab1d61af2",
        "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
        "refUID": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1743632120,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1743632123,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "GrantDetails",
        "data": {
          "proposalURL": "https://explorer.gitcoin.co/#/round/42220/31/18",
          "title": "Regen Coordination Global",
          "description": "",
          "payoutAddress": "0xa1cE98594e6844d850Db9Db9FE01b9595D445ca4",
          "programId": "31_42220",
          "questions": [
            {
              "type": "email",
              "query": "Email Address",
              "explanation": "brandon@regeneratecascadia.org"
            },
            {
              "type": "number",
              "query": "Team Size",
              "explanation": "8"
            },
            {
              "type": "checkbox",
              "query": "Is your project a member or past grantee of one of these networks?",
              "explanation": "BioFi Project"
            },
            {
              "type": "paragraph",
              "query": "What are your key active goals, plans, objectives or milestones for this year?",
              "explanation": "Regenerate Cascadia is excited to use this Gitcoin round, in partnership with Regen Coordination, to model a live bioregional flow funding round during the upcoming Cascadia BioFi Conference—directly disbursing funds to regenerative projects in real time. This participatory governance and funding experiment will help onboard new communities into Web3, demonstrate flow funding in action, and bring the shared theories of change from the BioFi Project and Regen Coordination to life.\n\nOur goal is to raise $10,000, which we will disburse live to groups as a model for Bioregional Finance and flow funding at the event.\n\nThe Cascadia BioFi Conference, taking place May 16–18, 2025, at the historic Georgetown Steam Plant in Seattle, will convene 200 leaders from the edges of finance, circular economy, land regeneration, Indigenous rematriation, community art, technology, and participatory governance. Together, we’ll co-create pathways for bioregional funding ecosystems that support long-term regenerative work throughout the Cascadia bioregion."
            }
          ],
          "type": "grant-details"
        },
        "txid": "0x6db63b8432d6714cc70cf4e62bee89590b1a0161264ca37544016f7118a02c93"
      },
      "project": {
        "_id": {
          "$oid": "67d73aab98a3199d0843d622"
        },
        "uid": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
        "schemaUID": "0xf3f753b41e04d1052b5a5ec7624d1dfdb6c2da288a985120e477ddbcac071022",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1742158493,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1742158507,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Project",
        "data": {
          "project": true
        },
        "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
        "categories": [
          {
            "_id": {
              "$oid": "682b32c8a94ec324b2d06b6a"
            },
            "name": "BioFi"
          }
        ]
      },
      "categories": [
        "BioFi"
      ],
      "milestones": [
        {
          "_id": {
            "$oid": "67fed5d5321d40f5b5a6b5fa"
          },
          "uid": "0x899f103e178ae4a782584028cdd3add2d490793b137b7a01b711f9520ab9113d",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
          "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
          "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744754129,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744754133,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "Milestone",
          "data": {
            "title": "Cascadia BioFi Conference & Funding Pilot",
            "description": "Since January 2025, Regenerate Cascadia has been planning the Cascadia BioFi Conference, a 3-day event taking place May 16–18, 2025, designed to pilot a live, participatory funding experience for regenerative land and community projects across the Cascadia bioregion.\n\nThis conference is not just a convening — it’s a proof-of-concept for how Regen Coordination’s vision of decentralized, transparent, community-led funding can function in a real-world bioregional setting.\n\nAt the heart of the event is a live disbursement pilot of a regenerative fund raised through the GG23 round and other aligned sources. We are working closely with Benjamin Life, Kevin Owocki, and ReFi partners to:\n\n✅ Onboard land-based groups to Web3 wallets and platforms\n\n✅ Train participants in participatory governance and coordination\n\n✅ Run a live budgeting process using tools like Quadratic Voting, Gitcoin Rounds, or Allo Protocol\n\n✅ Distribute pooled funds to regenerative projects through transparent, community-driven methods\n\nThis is a real-time demonstration of a Bioregional Funding Framework (BFF)—rooted in community, guided by bioregional priorities, and powered by Web3 tooling. Outcomes will include process documentation, funding results, key lessons learned, and a replicable playbook for other bioregions.\n\n📌 Direct Funding Alignment with Gitcoin GG23:\n\n**Support from this round will help:\n**- Seed the initial regenerative fund to be distributed at the event\n- Cover facilitation, onboarding, and education costs\n- Build technical and legal scaffolding for the funding mechanism\n- Ensure grassroots groups are supported, visible, and empowered in the pilot\n\nThis is a high-leverage opportunity to turn Regen Coordination’s theory into practice—bridging trust-based philanthropy with on-chain infrastructure in service to place.\n\n**🔗 Learn More:\n**🌐 https://cascadiabiofi.org\n📆 Conference Dates: May 16–18, 2025\n📍 Location: Georgetown Steam Plant, Seattle, Washington\n\n📊 Output Metrics\n\nMetric Name\t\n👥 Total Participants\t200+ attendees expected from across regenerative finance, land stewardship, mutual aid, and Web3\n💸 Funds Raised for Live Round\tTarget: $25,000–$50,000 pooled from Gitcoin + partners\n🌱 Regenerative Projects Funded\t10–20 local regenerative projects to receive microgrants\n🧠 Web3 Onboarding\t50+ new participants onboarded to wallets & platforms\n🗳 Governance Participation\t100+ participants involved in live voting and funding decisions\n📽 Livestream & Post-Event Media Views\t1,000+ projected video views and digital reach\n🧩 Prototype BFFs Initiated\t1–2 bioregional funding prototypes launched or refined\n🤝 Strategic Partners Engaged\t20+ collaborating orgs from ReFi, Web3, and local ecosystems\n\n🌟 North Star Outcome Alignment\n✅ Directly catalyzes ecological, social, and economic impact via bioregional disbursement\n✅ Increases awareness, engagement, and adoption of ReFi tools and governance practices\n✅ Demonstrates a live implementation of regenerative, decentralized coordination infrastructure",
            "endsAt": 1747551600,
            "startsAt": 1747378800,
            "priority": 1,
            "type": "milestone"
          },
          "txid": "0x847dea39e1d28bb853aa6a54ac4dc2305d9871d297bb251c260ff89de53da59d",
          "statuses": [],
          "rejected": [],
          "completed": [],
          "approved": [],
          "verified": []
        }
      ],
      "updates": [],
      "community": {
        "_id": {
          "$oid": "66e9e763ab96b4dace0e1a6b"
        },
        "uid": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
        "schemaUID": "0x3c2231024f4f17f3718b5bd9ed9ff29cc323dea5449f9ceba11a9888bfbdd0e1",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23B7A53ecfd93803C63b97316D7362eae59C55B6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1726605143,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1726605155,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Community",
        "data": {
          "community": true
        },
        "txid": "0xa6c51590c94ef8701cf2c5e7db62719abf68bda8ca8addc01ddbc5b9ea109313",
        "externalIds": [],
        "details": {
          "_id": {
            "$oid": "67f408946917f7b508a52ca0"
          },
          "uid": "0x66854f6787285a5fb553eb56d4b55f8b00a3767e13da6e1ca614b5ae394661c7",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x0000000000000000000000000000000000000000",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744046222,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744046228,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "CommunityDetails",
          "data": {
            "name": "Regen Coordination",
            "description": "The Regen Coordination Round is a proposal for a GG21 community round centered on the themes of Coordi-nations 3, Cosmo-localism 2, Bio-Regionalism 3, and Regenerative Finance (ReFi) 3. Bringing together GreenPill Network 1, ReFi DAO 1, Celo Regional DAOs 1 and Regens Unite 1, we aim to support a global movement of regenerative communities leveraging Web3 for real-world impact and addressing local needs. The round will feed into a program to support the further development of local community impact tracking methodologies, grant tooling interoperability, and integrated QF & RPGF. We have currently secured $60K in funding from Celo Public Goods, ReFi DAO and Greenpill and ask for Gitcoin’s backing as we embark on a shared mission to showcase how community coordination, Web3, and innovative financial mechanisms can enable ecological and social regeneration on a global scale.",
            "imageURL": "https://s3.us-east-1.amazonaws.com/showkarma.xyz/assets/karma-regen-coordination.png",
            "slug": "regen-coordination"
          },
          "txid": "0xfa63385f4be189fabdd1f77c9fb54f5dbc9a1728802c0675e3e45c0c5fb83e74"
        }
      }
    },
    {
      "_id": {
        "$oid": "67ea27939e0e7937ac29f570"
      },
      "uid": "0xcc583c6879c1872a8827d8c1c0e410e14a66063951a47d3deff4de0bd7ecf017",
      "schemaUID": "0x7afa603a89cee2d8f93d30007e2c64efddc6509fd76aa95d2ccd97b6e34acc71",
      "refUID": "0x2437fbc2e4ca95d77f11f893cdf8b5ef856bab25ac359d4628e79c66b896a1fd",
      "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
      "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
      "revoked": false,
      "revocationTime": 0,
      "createdAt": "2025-03-31T05:26:36.000Z",
      "updatedAt": "2025-03-31T05:26:43.000Z",
      "chainID": 42220,
      "type": "Grant",
      "data": {
        "communityUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d"
      },
      "txid": "0xeda3569d849c1a66242168f5fb7492189fcf49e4920eee6e5869ba33337b12a3",
      "external": {
        "gitcoin": [
          "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb"
        ]
      },
      "details": {
        "_id": {
          "$oid": "67ea27939e0e7937ac29f572"
        },
        "uid": "0x473d1d7854065a1374f08f3895876d8b98bb73071775fd9c8589ab44a6c5d491",
        "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
        "refUID": "0xcc583c6879c1872a8827d8c1c0e410e14a66063951a47d3deff4de0bd7ecf017",
        "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1743398796,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1743398803,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "GrantDetails",
        "data": {
          "title": "BioFi Pathfinders 🌱",
          "description": "About\nBuilding on more than 40 years of organizing from the first ever Cascadia Bioregional Congress held in 1986, Regenerate Cascadia is a social movement and capacity-building program developing a vision and framework to administer a bioregional flow fund and financing facility for Cascadia, a bioregion located along the upper Pacific Rim of North America stretching from Southeast Alaska to Northern California, and as far east as the Yellowstone Caldera.\n\nA central goal of Regenerate Cascadia is to grow capacity cohesively across the scales of landscapes, ecoregions, and bioregions—something that currently does not exist locally or globally—as part of a multi-generational strategy for the long-term health of the Cascadia bioregion.\n\nCascadia BioFi Facility\n\nRegenerate Cascadia is developing a critical path toward accelerated landscape-level regeneration across Cascadia that invites people to self-organize into bioregional teams and hubs in order to visualize, connect, and support work in their watersheds. Particularly through participatory activities and capacity-building. We invite these groups to consider:\n\nWhat does a regenerative future for our bioregion look like? If people were resourced to make this happen, how can this have the most impact and connect regenerators on the ground with funders and the technology we need, as best determined by the people doing the work? How do we build the buy-in and consent of our communities? And lastly, how do we use this “moment” to lead to a regenerative future rather than see it fizzle away?\n\nThe mission of Regenerate Cascadia is to regenerate the Cascadia bioregion and create the conditions for a regenerative culture to thrive. As part of this, we educate about bioregionalism, grow the shared context of our place, and give direct funding for the core capacity of teams and projects. We provide much-needed administrative scaffolding as groups are beginning so they can receive and leverage decentralized flow funding and spin out new bioregional initiatives as part of a shared, coherent, multi-generational regeneration strategy.\n\nThis first funding round will assist our watershed working groups in locations throughout Cascadia and help us experiment with new forms of shared governance and participatory budgeting processes at the landscape level.\n\nNow, we need your help to connect on-the-ground regenerative organizers, projects, and communities with the power and tools of Web3.\nCascadia BioFi Facility\n\nFigure 2: What is a BFF from the BioFi website - https://biofi.earth\n\nWeb3 can help break down and move past arbitrary boundaries, map what is important to our communities, identify what needs to be protected, and connect portfolios of projects in the context of an entire landscape in ways we can directly fund and de-risk. We need to create tools for measurement, reporting, and verification (MRV) built through community consent and data sovereignty that help tell the stories of stewardship in ways that catalyze financial flows.\n\nWe deeply believe in the founding beliefs of these tools, as outlined by Celo:\n\nWeb3 represents an internet where users have more control over their data, identity, and digital assets. This means no central authority controls the network, allowing for more transparency, security, and ownership. Web3 empowers individuals by giving them full control over their digital assets (like cryptocurrencies and NFTs) and how they interact with online services, making it a key shift towards a more open, user-owned internet. In short, Web3 is about returning power to the users—creating a more equitable digital world where your data and assets are yours to manage and control.\n\nTogether, we can learn to move money into communities at the scale of a watershed and across nation-state borders–reimagining finance flows so they no longer divide ecosystems and reinforce systematic inequality and racism–but instead create new stories of shared stewardship that truly represent the full spectrum of life present in place.\n\nLearn more about Cascadia BioFi\n\nRead our Regenerate Cascadia case study in the Bioregional Financing Facilities: Re-Imagining Finance to Regenerate the Planet E-Book\n\nLearning in parallel: See how we are growing a bioregional funding ecosystem at the first Forum of Bioregional Finance\n\nLaunching the Earth Regeneration Fund: Regenerate Cascadia is one of the first five bioregions\n\nWhere does this idea come from?\nRegenerate Cascadia Activation Tour\n\nFigure 3: Our Regenerate Cascadia activation tour. 14 communities in 30 days.\n\nRegenerate Cascadia grew from the 2022 global Regenerative Communities Network summit and was officially formed by Brandon Letsinger and Clare Attwell in April 2023 during the first-ever Salmon Nation Edge Prize, where their vision to activate a bioregional movement in Cascadia won the Edge Prize for Innovation in Systems and Governance.\n\nAfter months of planning with 100+ local community organizers on both sides of the Canada-US border, they partnered with the Design School for Regenerating Earth to co-facilitate a month-long Bioregional Activation Tour. We traveled to 14 communities around Cascadia during October 2023, hosting presentations that asked, “How do we regenerate the Cascadia bioregion?”. They met with more than 1000 individuals, including Indigenous knowledge keepers, regenerative leaders, groups, community artists, and elders across Oregon, Washington, and British Columbia, through presentations, workshops, site visits, and strategy sessions.\n\nRegenerate Cascadia Activation Tour\n\nFigure 4: Regenerate Cascadia was joined by Joe Brewer, Penny Heiple and Steven Morris from the Design School from Regenerating Earth. Every stop featured presentations, strategy sessions, field trips, and a showcase of regenerative work.\n\nThis was followed by an online summit that brought together 50+ presentations in a ‘Festival of What Works’ and concluded with an Open Space Unconference from November 3-12, 2023, where participants created working groups for Regenerate Cascadia. The vision resonated strongly with many communities across the bioregion, and since then have been working with an organizing team of more than 140 people through Telegram, exploring place-based \"hubs,\" issue-specific \"guilds,\" and supporting a range of amazing and emerging projects, made up of people on-the-ground doing regenerative work in-place.\n\nLearn more about Regenerate Cascadia:\n\nWatch the presentation: How do we regenerate an entire bioregion?\n\nAnnouncing the Winners and Special Honorees for The Edge Prize 2023: Weaving a Bioregional Fabric in the Edges of Salmon Nation\n\nFighting climate change by reconnecting to ecosystems in our own backyards - Article in the National Observer\n\nSee the 50+ recordings from the first Cascadia Bioregional Summit hosted last year\n\nWhy does it matter?\nCascadia Bioregion Wildfires\n\nFigure 5: A year of smoke. Satellite image of Cascadian wildfires from 2020.\n\nNature acts bioregionally. Be it wildfire, drought, flood, energy, food sovereignty, or social and political polarization, to develop adaptive resilience, every community impacted must have substantial influence on decision-making processes, and every community along a watershed must be included. It is the people living here, rather than in power centers thousands of miles away, who are best able to determine the most resilient pathways and actions for themselves and their communities.\n\nLearn more about Cascadia and Bioregional Organizing\n\nInterview with Brandon Letsinger and David Bollier and the Frontiers of Commoning\n\nShould We Rearrange the World's Borders According to Nature? Video by Claudia Ayuso, with Brandon Letsinger\n\nCascadian hello from the Antartic\n\nFigure 6: Hello from Antartica! Cascadia is more than just a place. It's a movement, a vision and an identity rooted in our love of place.\n\nThank you everyone for having us here and listening to our story of place. Now, let's make it happen & Viva Cascadia ✊🌲!\n\nIf you're unfamiliar with the idea of Cascadia or the Cascadia movement.... below is a bit of context about the bioregion and movement.\nWhat is Cascadia?\nStretching for more than 2500 along the Pacific Rim, the Cascadia bioregion includes British Columbia, Washington, Oregon, Idaho, and parts of Southeast Alaska and Northern California. It is defined through the geology and watersheds of the Fraser, Snake, and Columbia Rivers.\n\nCascadia Bioregion Map\n\nFigure 7: The Cascadia bioregion map by David McCloskey graced the cover of ESRI in 2014 and was featured on the cover of it's annual book. Featuring more than 70 GIS layers, McCloskey published some of the first maps in the 1980's, and coined the term \"Cascadia bioregion\" as a Seattle University professor in 1981.\n\nWe have tremendous opportunities for systemic and strategic impact here and are often considered a \"thin green line\" between resource extraction to the east and developing markets in Asia.\n\nThe Cascadia bioregion is home to more than 16 million people (16,029,520). It has an economy generating more than 1.613147 trillion worth of goods and services annually, making it the world's ninth-largest economy and roughly equivalent to that of Canada or Italy. Its population would be similar in size to Ecuador, Zambia, Cambodia, or the Netherlands. Cascadia contains the largest tracts of untouched old-growth temperate rainforests in the world, including 7 of the top 10 world carbon-absorbing forests, the world's tallest trees, thousands of volcanoes, hot springs, rivers, lakes, inlets, islands, and ocean, and some of the last diminishing, though still impressive wild habitats of salmon, wolves, bear, whale, orca. More than 350 bird and mammal species, 48 reptiles, hundreds of fungi, lichen, and thousands of invertebrates and soil organisms call Cascadia home.\n\nThe Cascadia bioregion also transcends the arbitrary border between the United States and Canada, and so must our planning. This is true when looking at the Salish Sea (a shared ecosystem between Seattle and Vancouver, BC, in which eight million people live), the Cascadia subduction zone, which runs the entire length of Cascadia and is where our next megaquake will come from, or the Cascadia megaregion, an urban core between Vancouver, BC and Eugene, OR where 80% of the population live on 17% of the landmass.\n\nThe Columbia River watershed alone, the largest in Cascadia, includes parts of six US states and one Canadian province. Its border is traced “not by governments or treaties, but by every drop of liquid that finds a common path to the ocean.”\n\nWhat is the Cascadia Movement?\nCascadians are brought together by their love of place and desire to protect the things we find special while improving the well-being of everyone and everything living here.\n\nFirst Cascadia Bioregional congress\n\nFigure 8: Cascadian bioregional congresses took place every other year from 1986, timed to coincide with the North American bioregional congress, as well as smaller local regional \"Ish River\" gatherings.\n\nCascadia was first used as a geologic description in 1981 by Seattle University professor David McCloskey to better describe our growing regional identity. McCloskey describes Cascadia as “a land of falling waters.” He notes the blending of the natural integrity and the sociocultural unity that gives Cascadia its character. It was officially incorporated by policy planners, First Nations, and community organizers at the first Cascadia Bioregional Congress in 1986.\n\nToday, the Cascadia movement includes tens of thousands of individuals, businesses, and community groups throughout the Cascadia bioregion. Cascadia has been featured in many publications, such as Vice Magazine, USA Today, NPR, the CBC, NY Times, CNN, Forbes, Portland Monthly, the Seattle Times, the Wall Street Journal, the Oregonian, and many others.",
          "linkToProposal": "https://explorer.gitcoin.co/#/projects/0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb",
          "amount": "$6400",
          "milestones": [],
          "community": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
          "startDate": 1729580400,
          "programId": "18_42220",
          "questions": [],
          "proposalURL": "https://explorer.gitcoin.co/#/projects/0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb",
          "assetAndChainId": [
            "0x0",
            1
          ],
          "payoutAddress": "0xa1cE98594e6844d850Db9Db9FE01b9595D445ca4",
          "type": "grant-details"
        },
        "txid": "0xeda3569d849c1a66242168f5fb7492189fcf49e4920eee6e5869ba33337b12a3"
      },
      "project": {
        "_id": {
          "$oid": "67ea21b9622380908b15e345"
        },
        "uid": "0x2437fbc2e4ca95d77f11f893cdf8b5ef856bab25ac359d4628e79c66b896a1fd",
        "schemaUID": "0x5b873b6e7a16207b526dde366e8164e95bcda2f009272306519667c5e94d2191",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1743397301,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1743397305,
            "i": 0
          }
        },
        "chainID": 10,
        "type": "Project",
        "data": {
          "project": true
        },
        "txid": "0x60cb7069c57f0fff856f935a1b82fc302852b0e1ce95521d12e1780af6e6946a",
        "categories": []
      },
      "categories": [],
      "milestones": [],
      "updates": [],
      "community": {
        "_id": {
          "$oid": "66e9e763ab96b4dace0e1a6b"
        },
        "uid": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
        "schemaUID": "0x3c2231024f4f17f3718b5bd9ed9ff29cc323dea5449f9ceba11a9888bfbdd0e1",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23B7A53ecfd93803C63b97316D7362eae59C55B6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1726605143,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1726605155,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Community",
        "data": {
          "community": true
        },
        "txid": "0xa6c51590c94ef8701cf2c5e7db62719abf68bda8ca8addc01ddbc5b9ea109313",
        "externalIds": [],
        "details": {
          "_id": {
            "$oid": "67f408946917f7b508a52ca0"
          },
          "uid": "0x66854f6787285a5fb553eb56d4b55f8b00a3767e13da6e1ca614b5ae394661c7",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x0000000000000000000000000000000000000000",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744046222,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744046228,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "CommunityDetails",
          "data": {
            "name": "Regen Coordination",
            "description": "The Regen Coordination Round is a proposal for a GG21 community round centered on the themes of Coordi-nations 3, Cosmo-localism 2, Bio-Regionalism 3, and Regenerative Finance (ReFi) 3. Bringing together GreenPill Network 1, ReFi DAO 1, Celo Regional DAOs 1 and Regens Unite 1, we aim to support a global movement of regenerative communities leveraging Web3 for real-world impact and addressing local needs. The round will feed into a program to support the further development of local community impact tracking methodologies, grant tooling interoperability, and integrated QF & RPGF. We have currently secured $60K in funding from Celo Public Goods, ReFi DAO and Greenpill and ask for Gitcoin’s backing as we embark on a shared mission to showcase how community coordination, Web3, and innovative financial mechanisms can enable ecological and social regeneration on a global scale.",
            "imageURL": "https://s3.us-east-1.amazonaws.com/showkarma.xyz/assets/karma-regen-coordination.png",
            "slug": "regen-coordination"
          },
          "txid": "0xfa63385f4be189fabdd1f77c9fb54f5dbc9a1728802c0675e3e45c0c5fb83e74"
        }
      }
    },
    {
      "_id": {
        "$oid": "67d73aac98a3199d0843d624"
      },
      "uid": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
      "schemaUID": "0x7afa603a89cee2d8f93d30007e2c64efddc6509fd76aa95d2ccd97b6e34acc71",
      "refUID": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
      "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "revoked": false,
      "revocationTime": 0,
      "createdAt": "2025-03-16T20:54:53.000Z",
      "updatedAt": "2025-03-16T20:55:08.000Z",
      "chainID": 42220,
      "type": "Grant",
      "data": {
        "communityUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d"
      },
      "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
      "external": {
        "gitcoin": [
          "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb"
        ]
      },
      "details": {
        "_id": {
          "$oid": "67fecb25d9c7b759f217dd68"
        },
        "uid": "0x5bc88b78e098af1ad53b0c6808160bc3071c1dd6aa39fd50b2a342d642bf50ed",
        "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
        "refUID": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
        "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1744751390,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1744751397,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "GrantDetails",
        "data": {
          "title": "BioFi Pathfinders 🌱",
          "description": "The Bioregional Finance (BioFi) Pathfinders Round is a partnership between The BioFi Project, Open Civics, The Design School for Regenerating Earth, and Regen Coordination to support the most sophisticated Bioregional Organizing Teams around the world in developing, clarifying, and enhancing their BioFi vision, strategy, and capabilities. This invite-only round is aimed at advanced teams that are already practicing or actively developing their approach to Bioregional Finance (BioFi), with a focus on building Bioregional Financing Facilities (BFFs) or bioregional funding ecosystems more broadly. For detailed suggested questions to help shape your project description, visit https://nifty-humidity-dcf.notion.site/Pathfinders-Grantee-Questions-Template-fa60a0314b174422bd1f2735e3541cdc?pvs=4\n\n🌀 Gitcoin Grant Reporting Story – Regenerate Cascadia & the Department of Bioregion\nWe are rooted in the Cascadia bioregion, a land and sea mosaic stretching from the Pacific Ocean to the Continental Divide, and from Southeast Alaska through British Columbia, Washington, Oregon, and into parts of Northern California and Idaho. This place is defined not by lines on a map, but by the living systems that shape it—salmon-bearing watersheds, coastal rainforests, fire-adapted mountain ranges, and the people who are in relationship with them. Our shared identity is shaped by the rhythms of water and forest, food and fire, migration and culture.\n\nThe Department of Bioregion has spent more than a decade mapping Cascadia through both scientific and cultural lenses—hydrology, ecology, language, Indigenous territories, community feedback, and systems awareness. We don’t see mapping as a static process, but as a living conversation: a collective act of reclaiming and remembering how we are embedded in place. More than 100 maps and resources have been collaboratively created, always rooted in the understanding that bioregions are not just ecological units—they are cultural, economic, and political possibilities.\n\nCascadia faces deep, systemic challenges: ecological degradation from industrial extraction, housing crises and colonial land ownership patterns, siloed governance, and a disconnection between urban centers and rural, Indigenous, and working communities. But we also feel we are approaching a tipping point. A new generation is hungry for alternatives. From Indigenous land rematriation to community-owned energy and cooperative food systems, seeds of a regenerative bioregional economy are already germinating. The vision is not about scaling up, but about deepening down—networks of community-led, place-based resilience that are interconnected across watersheds and eco-cultural corridors.\n\nOur bioregional organizing effort began informally—as a coalition of mappers, artists, community organizers, land stewards, and decentralized tech builders. Today, through Regenerate Cascadia, we’re evolving into a more formal constellation of weavers, nodes, and affinity groups. Our “team” is distributed and emergent, guided by a deep commitment to polycentric, non-hierarchical governance and distributed leadership. We hold convenings, co-create visioning tools, publish educational materials, and serve as connective tissue between existing movements.\n\nRight now, we’re serving as a backbone support for bioregional convergence efforts, supporting local hubs, and facilitating participatory design for what comes next. Our work includes co-developing shared tools for bioregional mapping, coordinating mutual aid and resilience networks, exploring cooperative financing infrastructure, and supporting aligned projects across the region. Our future vision includes hosting watershed assemblies, building open-source Bioregional Funding Frameworks (BFFs), and helping transition land, capital, and governance to steward communities.\n\nEngagement with Indigenous Peoples and wisdom traditions is essential to our work. We do not claim to represent any Indigenous nation, but we acknowledge that Cascadia exists entirely on Indigenous lands, and our vision of regeneration is impossible without Indigenous sovereignty and leadership. We are in ongoing relationship-building, listening, and learning—especially around traditional ecological knowledge, ceremony, and governance models that offer deep guidance for decentralized, place-based systems. We are committed to creating space for these voices to lead the bioregional story, and to supporting land back and cultural resurgence efforts whenever possible.\n\nWe are still in the early stages of crafting a shared landscape vision, but significant momentum is growing. Through the Regenerate Cascadia process, more than 50 local convergence events have been held across the bioregion since 2023, creating a rich web of partnerships—with food sovereignty orgs, eco-villages, climate justice groups, regenerative finance practitioners, and more. We are now coalescing around a collective strategy grounded in shared values and mutual support.\n\nWhen it comes to money, we’ve mostly been scrappy and decentralized—funding this work through small grants, mutual aid, and volunteer effort. The Gitcoin round has been a huge catalyst, helping us prototype collective resourcing strategies. Money often flows in fragmented, competitive, and opaque ways here, reinforcing scarcity. We want to change that. Our dream is a bioregional funding ecosystem—a transparent, participatory, and solidarity-based commons where capital flows toward community-defined priorities.\n\nWe envision Bioregional Funding Frameworks (BFFs) that enable decentralized grantmaking, cooperative ownership, open accounting, and community-governed trusts. These mechanisms should be adaptive, transparent, and deeply place-based—tools to help us resource what regeneration feels like in each unique watershed. The biggest obstacles? Legal and technical infrastructure, organizational capacity, and overcoming the legacy of extractive systems. We need support navigating incorporation, compliance, participatory budgeting tools, and storytelling to share our vision widely.\n\nWe’ve learned that trust, relationships, and shared language are far more valuable than any single financial tool. We’ve also learned that trying to “scale up” too quickly—without deep local grounding—can cause fragmentation. Our biggest questions include: How do we move from convening to co-governance? How do we redistribute power, not just resources? How do we honor cultural complexity without diluting vision?\n\nWe’re using Gitcoin funds to deepen these explorations: hosting strategy gatherings, piloting cooperative funding tools, developing educational resources, and designing structures for long-term stewardship. This includes creating materials for fundraising and public engagement, supporting regional nodes, and laying the groundwork for a participatory bioregional governance model.\n\nThis is not just about Cascadia. It's about creating a replicable model that others can adapt to their own bioregions. Together, we are remembering how to live in right relationship—with land, with each other, and with the future.",
          "payoutAddress": "0xa1cE98594e6844d850Db9Db9FE01b9595D445ca4",
          "type": "grant-details",
          "amount": "",
          "linkToProposal": "",
          "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "community": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "proposalURL": ""
        },
        "txid": "0x5137fd7cb591cbaeef16e59d1712828cb34340bc0bf43ff732068ed440b884c5"
      },
      "project": {
        "_id": {
          "$oid": "67d73aab98a3199d0843d622"
        },
        "uid": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
        "schemaUID": "0xf3f753b41e04d1052b5a5ec7624d1dfdb6c2da288a985120e477ddbcac071022",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1742158493,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1742158507,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Project",
        "data": {
          "project": true
        },
        "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
        "categories": [
          {
            "_id": {
              "$oid": "682b32c8a94ec324b2d06b6a"
            },
            "name": "BioFi"
          }
        ]
      },
      "categories": [
        "BioFi"
      ],
      "milestones": [],
      "updates": [
        {
          "_id": {
            "$oid": "67d73aad98a3199d0843d629"
          },
          "uid": "0xc6d3d99c17514ec4e1c34c429eca0e6a89a0a5b5866fda3e0a657ae87c818328",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0x72c8fa5353fee0a2a978ee4275f335bffad01ff5a277b15747dc71c53c7e2c06",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1742158493,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1742158509,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "GrantUpdate",
          "data": {
            "text": "Updates can be found here: undefined",
            "type": "grant-update",
            "title": ""
          },
          "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1"
        }
      ],
      "community": {
        "_id": {
          "$oid": "66e9e763ab96b4dace0e1a6b"
        },
        "uid": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
        "schemaUID": "0x3c2231024f4f17f3718b5bd9ed9ff29cc323dea5449f9ceba11a9888bfbdd0e1",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23B7A53ecfd93803C63b97316D7362eae59C55B6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1726605143,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1726605155,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Community",
        "data": {
          "community": true
        },
        "txid": "0xa6c51590c94ef8701cf2c5e7db62719abf68bda8ca8addc01ddbc5b9ea109313",
        "externalIds": [],
        "details": {
          "_id": {
            "$oid": "67f408946917f7b508a52ca0"
          },
          "uid": "0x66854f6787285a5fb553eb56d4b55f8b00a3767e13da6e1ca614b5ae394661c7",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x0000000000000000000000000000000000000000",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744046222,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744046228,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "CommunityDetails",
          "data": {
            "name": "Regen Coordination",
            "description": "The Regen Coordination Round is a proposal for a GG21 community round centered on the themes of Coordi-nations 3, Cosmo-localism 2, Bio-Regionalism 3, and Regenerative Finance (ReFi) 3. Bringing together GreenPill Network 1, ReFi DAO 1, Celo Regional DAOs 1 and Regens Unite 1, we aim to support a global movement of regenerative communities leveraging Web3 for real-world impact and addressing local needs. The round will feed into a program to support the further development of local community impact tracking methodologies, grant tooling interoperability, and integrated QF & RPGF. We have currently secured $60K in funding from Celo Public Goods, ReFi DAO and Greenpill and ask for Gitcoin’s backing as we embark on a shared mission to showcase how community coordination, Web3, and innovative financial mechanisms can enable ecological and social regeneration on a global scale.",
            "imageURL": "https://s3.us-east-1.amazonaws.com/showkarma.xyz/assets/karma-regen-coordination.png",
            "slug": "regen-coordination"
          },
          "txid": "0xfa63385f4be189fabdd1f77c9fb54f5dbc9a1728802c0675e3e45c0c5fb83e74"
        }
      }
    },
    {
      "_id": {
        "$oid": "67edb6fb38e5aedb69e8c4e7"
      },
      "uid": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
      "schemaUID": "0x7afa603a89cee2d8f93d30007e2c64efddc6509fd76aa95d2ccd97b6e34acc71",
      "refUID": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
      "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
      "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
      "revoked": false,
      "revocationTime": 0,
      "createdAt": "2025-04-02T22:15:20.000Z",
      "updatedAt": "2025-04-02T22:15:23.000Z",
      "chainID": 42220,
      "type": "Grant",
      "data": {
        "communityUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d"
      },
      "txid": "0x6db63b8432d6714cc70cf4e62bee89590b1a0161264ca37544016f7118a02c93",
      "external": {
        "gitcoin": [
          "0xd9cfac0a6257b1c8ddb06781097a016f78054df6f8d00d118b80723b0ed1ccbb"
        ]
      },
      "details": {
        "_id": {
          "$oid": "67edb6fb38e5aedb69e8c4e8"
        },
        "uid": "0x6e045280df4adaf3c35f0ce2115508c56c12dad6a922ee81a9a729fab1d61af2",
        "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
        "refUID": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1743632120,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1743632123,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "GrantDetails",
        "data": {
          "proposalURL": "https://explorer.gitcoin.co/#/round/42220/31/18",
          "title": "Regen Coordination Global",
          "description": "",
          "payoutAddress": "0xa1cE98594e6844d850Db9Db9FE01b9595D445ca4",
          "programId": "31_42220",
          "questions": [
            {
              "type": "email",
              "query": "Email Address",
              "explanation": "brandon@regeneratecascadia.org"
            },
            {
              "type": "number",
              "query": "Team Size",
              "explanation": "8"
            },
            {
              "type": "checkbox",
              "query": "Is your project a member or past grantee of one of these networks?",
              "explanation": "BioFi Project"
            },
            {
              "type": "paragraph",
              "query": "What are your key active goals, plans, objectives or milestones for this year?",
              "explanation": "Regenerate Cascadia is excited to use this Gitcoin round, in partnership with Regen Coordination, to model a live bioregional flow funding round during the upcoming Cascadia BioFi Conference—directly disbursing funds to regenerative projects in real time. This participatory governance and funding experiment will help onboard new communities into Web3, demonstrate flow funding in action, and bring the shared theories of change from the BioFi Project and Regen Coordination to life.\n\nOur goal is to raise $10,000, which we will disburse live to groups as a model for Bioregional Finance and flow funding at the event.\n\nThe Cascadia BioFi Conference, taking place May 16–18, 2025, at the historic Georgetown Steam Plant in Seattle, will convene 200 leaders from the edges of finance, circular economy, land regeneration, Indigenous rematriation, community art, technology, and participatory governance. Together, we’ll co-create pathways for bioregional funding ecosystems that support long-term regenerative work throughout the Cascadia bioregion."
            }
          ],
          "type": "grant-details"
        },
        "txid": "0x6db63b8432d6714cc70cf4e62bee89590b1a0161264ca37544016f7118a02c93"
      },
      "project": {
        "_id": {
          "$oid": "67d73aab98a3199d0843d622"
        },
        "uid": "0x94c927f2ef198b0b30319cb82f6bdca4f53acfe49530cae157d37751a355a9e6",
        "schemaUID": "0xf3f753b41e04d1052b5a5ec7624d1dfdb6c2da288a985120e477ddbcac071022",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1742158493,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1742158507,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Project",
        "data": {
          "project": true
        },
        "txid": "0x6f9046be0d81d23b3f6649f386e831871bc1f037ee10a621d9c1cb0dc0bc10c1",
        "categories": [
          {
            "_id": {
              "$oid": "682b32c8a94ec324b2d06b6a"
            },
            "name": "BioFi"
          }
        ]
      },
      "categories": [
        "BioFi"
      ],
      "milestones": [
        {
          "_id": {
            "$oid": "67fed5d5321d40f5b5a6b5fa"
          },
          "uid": "0x899f103e178ae4a782584028cdd3add2d490793b137b7a01b711f9520ab9113d",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xa0b2a8da2bb424f6c6f7ea20a5ef8e69316a4fc8065f961ef82a2b1800aafd15",
          "attester": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
          "recipient": "0xa1ce98594e6844d850db9db9fe01b9595d445ca4",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744754129,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744754133,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "Milestone",
          "data": {
            "title": "Cascadia BioFi Conference & Funding Pilot",
            "description": "Since January 2025, Regenerate Cascadia has been planning the Cascadia BioFi Conference, a 3-day event taking place May 16–18, 2025, designed to pilot a live, participatory funding experience for regenerative land and community projects across the Cascadia bioregion.\n\nThis conference is not just a convening — it’s a proof-of-concept for how Regen Coordination’s vision of decentralized, transparent, community-led funding can function in a real-world bioregional setting.\n\nAt the heart of the event is a live disbursement pilot of a regenerative fund raised through the GG23 round and other aligned sources. We are working closely with Benjamin Life, Kevin Owocki, and ReFi partners to:\n\n✅ Onboard land-based groups to Web3 wallets and platforms\n\n✅ Train participants in participatory governance and coordination\n\n✅ Run a live budgeting process using tools like Quadratic Voting, Gitcoin Rounds, or Allo Protocol\n\n✅ Distribute pooled funds to regenerative projects through transparent, community-driven methods\n\nThis is a real-time demonstration of a Bioregional Funding Framework (BFF)—rooted in community, guided by bioregional priorities, and powered by Web3 tooling. Outcomes will include process documentation, funding results, key lessons learned, and a replicable playbook for other bioregions.\n\n📌 Direct Funding Alignment with Gitcoin GG23:\n\n**Support from this round will help:\n**- Seed the initial regenerative fund to be distributed at the event\n- Cover facilitation, onboarding, and education costs\n- Build technical and legal scaffolding for the funding mechanism\n- Ensure grassroots groups are supported, visible, and empowered in the pilot\n\nThis is a high-leverage opportunity to turn Regen Coordination’s theory into practice—bridging trust-based philanthropy with on-chain infrastructure in service to place.\n\n**🔗 Learn More:\n**🌐 https://cascadiabiofi.org\n📆 Conference Dates: May 16–18, 2025\n📍 Location: Georgetown Steam Plant, Seattle, Washington\n\n📊 Output Metrics\n\nMetric Name\t\n👥 Total Participants\t200+ attendees expected from across regenerative finance, land stewardship, mutual aid, and Web3\n💸 Funds Raised for Live Round\tTarget: $25,000–$50,000 pooled from Gitcoin + partners\n🌱 Regenerative Projects Funded\t10–20 local regenerative projects to receive microgrants\n🧠 Web3 Onboarding\t50+ new participants onboarded to wallets & platforms\n🗳 Governance Participation\t100+ participants involved in live voting and funding decisions\n📽 Livestream & Post-Event Media Views\t1,000+ projected video views and digital reach\n🧩 Prototype BFFs Initiated\t1–2 bioregional funding prototypes launched or refined\n🤝 Strategic Partners Engaged\t20+ collaborating orgs from ReFi, Web3, and local ecosystems\n\n🌟 North Star Outcome Alignment\n✅ Directly catalyzes ecological, social, and economic impact via bioregional disbursement\n✅ Increases awareness, engagement, and adoption of ReFi tools and governance practices\n✅ Demonstrates a live implementation of regenerative, decentralized coordination infrastructure",
            "endsAt": 1747551600,
            "startsAt": 1747378800,
            "priority": 1,
            "type": "milestone"
          },
          "txid": "0x847dea39e1d28bb853aa6a54ac4dc2305d9871d297bb251c260ff89de53da59d",
          "statuses": [],
          "rejected": [],
          "completed": [],
          "approved": [],
          "verified": []
        }
      ],
      "updates": [],
      "community": {
        "_id": {
          "$oid": "66e9e763ab96b4dace0e1a6b"
        },
        "uid": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
        "schemaUID": "0x3c2231024f4f17f3718b5bd9ed9ff29cc323dea5449f9ceba11a9888bfbdd0e1",
        "refUID": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
        "recipient": "0x23B7A53ecfd93803C63b97316D7362eae59C55B6",
        "revoked": false,
        "revocationTime": 0,
        "createdAt": {
          "$timestamp": {
            "t": 1726605143,
            "i": 0
          }
        },
        "updatedAt": {
          "$timestamp": {
            "t": 1726605155,
            "i": 0
          }
        },
        "chainID": 42220,
        "type": "Community",
        "data": {
          "community": true
        },
        "txid": "0xa6c51590c94ef8701cf2c5e7db62719abf68bda8ca8addc01ddbc5b9ea109313",
        "externalIds": [],
        "details": {
          "_id": {
            "$oid": "67f408946917f7b508a52ca0"
          },
          "uid": "0x66854f6787285a5fb553eb56d4b55f8b00a3767e13da6e1ca614b5ae394661c7",
          "schemaUID": "0x9895e82115987d8e3e02b35ced92e6a0509293890333f58f50ec291b34853dac",
          "refUID": "0xccff29d65d80f9ae4e6bc9b6a09b4e4dd588e47333903aa0f9c8b251cc91d96d",
          "attester": "0x23b7a53ecfd93803c63b97316d7362eae59c55b6",
          "recipient": "0x0000000000000000000000000000000000000000",
          "revoked": false,
          "revocationTime": 0,
          "createdAt": {
            "$timestamp": {
              "t": 1744046222,
              "i": 0
            }
          },
          "updatedAt": {
            "$timestamp": {
              "t": 1744046228,
              "i": 0
            }
          },
          "chainID": 42220,
          "type": "CommunityDetails",
          "data": {
            "name": "Regen Coordination",
            "description": "The Regen Coordination Round is a proposal for a GG21 community round centered on the themes of Coordi-nations 3, Cosmo-localism 2, Bio-Regionalism 3, and Regenerative Finance (ReFi) 3. Bringing together GreenPill Network 1, ReFi DAO 1, Celo Regional DAOs 1 and Regens Unite 1, we aim to support a global movement of regenerative communities leveraging Web3 for real-world impact and addressing local needs. The round will feed into a program to support the further development of local community impact tracking methodologies, grant tooling interoperability, and integrated QF & RPGF. We have currently secured $60K in funding from Celo Public Goods, ReFi DAO and Greenpill and ask for Gitcoin’s backing as we embark on a shared mission to showcase how community coordination, Web3, and innovative financial mechanisms can enable ecological and social regeneration on a global scale.",
            "imageURL": "https://s3.us-east-1.amazonaws.com/showkarma.xyz/assets/karma-regen-coordination.png",
            "slug": "regen-coordination"
          },
          "txid": "0xfa63385f4be189fabdd1f77c9fb54f5dbc9a1728802c0675e3e45c0c5fb83e74"
        }
      }
    }
  ]
}