{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-46958966635089507957945695825584013180928",
          "metadata": {
            "name": "Ecovillage network GEN Ukraine ",
            "description": "Our project supports ecological regeneration and community resilience in war-affected regions of Ukraine through collaborative land restoration initiatives. Coordinated by GEN Ukraine, a network of 60+ rural ecovillages, we involve residents, displaced families, eco-activists, and international allies in restoring biodiversity, water systems, and landscape health.\n\nRestoration actions are community-led, uniting villagers, internally displaced persons (IDPs), eco-activists, and international volunteers across all ages. Local families prepare lands, maintain ecosystems, and integrate ecological improvements into daily life, engaging 20–40 participants per event. Women and youth notably drive ongoing care and education.\n\nSpanning over 11 ecovillages including Gruzke, Vesela Slobidka, Posolon, Zhyvy Dim, Kukhari, Tepla Hora (Carpathians), Vasylivka, Chmyrivka, Bhumi, Balyky, and Lahulsk Dendropark, these efforts represent robust grassroots initiatives addressing land degradation and climate challenges despite ongoing conflict.\n\nKey activities include planting over 2000 trees and shrubs (linden, mulberry, pine, hazel, rhododendrons), establishing water management systems in Tepla Hora, Chmyrivka, and Vasylivka, and initiating grazing-based regeneration through eco-farms in Bhumi and Balyky. Lahulsk Dendropark has seen the construction of a 3 km ecological road supporting reforestation and conservation.\n\nQuantifiable impacts include:\n- 2000+ trees and bushes planted\n- 5 water systems established or underway\n- 4 hectares restored via lake and wetlands\n- 100 meters of river cleared\n- Improved biodiversity and ecosystem resilience in multiple regions\n\nThis initiative demonstrates that communities can regenerate nature and foster social healing, making meaningful strides toward a sustainable future.\n\n"
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744122054",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://github.com/maxzalevski/regenerative_lands\"}",
                    "{\"type\":\"url\",\"src\":\"https://github.com/maxzalevski/tree_planting\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "46958966635089507957945695825584013180928",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "e368f4c1-7ba7-42b4-8921-80f7e96c9448"
              }
            ]
          }
        }
      ]
    }
  }
}