{
  "id": "1",
  "chainId": 42220,
  "roundId": "35",
  "projectId": "0x15c5e4db5530e05216abc9484025e2f1c4fb55b8525d29ef38fde237e767e324",
  "metadata": {
    "signature": "0x89be63b75f2d5e1a75ab1dc9d21aef03d5f009fef74603cf54d0448f7a119993372649fc6df5c57fd74cff98bbd94ab7649a8de19ae04dd501cf17905a16c2d51c",
    "application": {
      "round": "0xd1DBAE8f44ac7798B6eE3Eb739828ccc9eDb8EBB",
      "answers": [],
      "project": {
        "id": "0x15c5e4db5530e05216abc9484025e2f1c4fb55b8525d29ef38fde237e767e324",
        "title": "ReFi DAO - A Network Society to Regenerate Earth. ✨ 🌱",
        "logoImg": "bafkreigsxrlilj5op327wgzvuegtvfonnauev7axjctndr6wnpqbj2br34",
        "metaPtr": {
          "pointer": "bafkreigiuwk6gcnnnjubnvknpfw4ygorrcza2dhvfarhndeojvep232m7a",
          "protocol": "undefined"
        },
        "website": "https://refidao.com",
        "bannerImg": "bafybeihp7t2pafkpqpbi76kc2lkgupylgjfuzyzg37qi5oznl3k6mgafou",
        "createdAt": 1713260063378,
        "credentials": {
          "twitter": {
            "type": [
              "VerifiableCredential"
            ],
            "proof": {
              "jws": "eyJhbGciOiJFZERTQSIsImNyaXQiOlsiYjY0Il0sImI2NCI6ZmFsc2V9..SB7Bd9LjbDSDjQszvGIR1KFL0co5MwgA6yorp6OL5gtkjEmyUBf3Sb3MqVnJCxcVVdzYr_Cxsa6RYjPzvey7Ag",
              "type": "Ed25519Signature2018",
              "created": "2024-04-16T08:51:14.776Z",
              "proofPurpose": "assertionMethod",
              "verificationMethod": "did:key:z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC#z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC"
            },
            "issuer": "did:key:z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC",
            "@context": [
              "https://www.w3.org/2018/credentials/v1"
            ],
            "issuanceDate": "2024-04-16T08:51:14.776Z",
            "expirationDate": "2024-07-15T08:51:14.776Z",
            "credentialSubject": {
              "id": "did:pkh:eip155:1:0x7340F1a1e4e38F43d2FCC85cdb2b764de36B40c0",
              "hash": "v0.0.0:/oOAUIJ08paMSKrrt+v93F4VKj6OTKhH2YK+iK95l9Q=",
              "@context": [
                {
                  "hash": "https://schema.org/Text",
                  "provider": "https://schema.org/Text"
                }
              ],
              "provider": "ClearTextTwitter#ReFiDAOist"
            }
          }
        },
        "description": "*ReFi DAO is at the forefront of catalyzing the Regenerative Finance (ReFi) movement, a pioneering force dedicated to leveraging Web3 technologies to foster projects and systems that prioritize ecological and social well-being. ReFi DAO’s projects range from local initiatives driving tangible community impacts to global efforts aimed at driving ecological impact and sustainable development with innovative finance & technology solutions. With a proven track record and a clear vision for the future, we seek support to expand our impact and continue being a cornerstone of the Web3 climate community.*\n\n# **Ecological Impact & Recent Updates**\n\nIn the past year, ReFi DAO has expanded its ecological and educational initiatives. Some recent highlights and actions include:\n\n- **ReFi Week and Mass Tree Planting:** Organized a collaborative week of workshops and innovation sessions, culminating in the planting of over 700 trees using Silvi Protocol's dMRV technology. This initiative demonstrated the fusion of digital tools with real-world ecological action, reinforcing our commitment to tangible climate solutions. [Read more about ReFi Week](https://blog.refidao.com/regeneration-at-refi-week/)\n    \n    ![refiweek.png](https://i.imgur.com/KzLWDiF.png)\n    \n- **Initiation of ReFi EBF:** In partnership between [ReFi DAO](https://linktr.ee/refidao?ref=blog.refidao.com) & [The Lexicon](https://www.thelexicon.org/?ref=blog.refidao.com), ReFi EBF is an initiative with a mission to intertwine and enhance the Ecological Benefits Framework (EBF) within the ecosystem of Regenerative Finance (ReFi) and Web3 technology. We believe that EBF will serve as a foundational framework for evaluating genuine ecological impact within the Web3 & ReFi domain, and beyond. So far, this initiative has helped to catalyse a wave of EBF-related interest and action in the Web3 & ReFi space, with many organisations pledging their commitment towards furthering a more holistic approach to environmental impact beyond carbon tunnel vision. [Learn more about this partnership](https://blog.refidao.com/refi-ebf-whats-next/)\n    \n    ![ReFi EBF Pledges](https://i.imgur.com/XOwAnZz.png)\n    \n- **Supporting ReFi Local Nodes, Ecological Impact, & [#OperationWebTree](https://drive.google.com/file/d/1QESx9MJ7uVneMNZw22qznnJgstklTqEI/view?usp=drive_link):** Increased funding and support for ReFi Local Nodes, which have initiated projects like urban reforestation in Miami and a carbon-backed NFT marketplace in Tanzania. These projects are pivotal in driving localized regenerative efforts and showcasing the scalable impact of decentralized environmental action. See here for a comprehensive overview of the work and impacts of the ReFi Local Node Network in 2023: [Regenerative Journeys: ReFi Local Nodes 2023 Roundup](https://mirror.xyz/refidao.eth/pzwS5ape0Zqu5mnqKM60eIqMfBtLjQ18UEy1jiDeAHU) & ReFi Local Node Network in 2024: [ReFi Local Nodes Showcase 2024 ✨](https://blog.refidao.com/refi-local-nodes-showcase-2024/).\n    \n    ![refi local node hypercerts](https://i.imgur.com/0U8Nlup.png)\n    \n- **Launching the ReFi Local Node Beta Incubator Program:** Expanded our support for community-driven regeneration projects globally by initiating the Beta Incubator program, which fosters the development of new Local Nodes. This program is designed to catalyze and support innovative local solutions to ecological challenges. [Learn more about the incubator](https://blog.refidao.com/local-node-beta-incubator/) \n    \n    ![Local Node Beta Incubator](https://i.imgur.com/fPWeHjM.png)\n    \n- **Publishing The State of ReFi 2024 Report:** In collaboration with CARBON Copy, we produced a comprehensive report detailing the advancements and narratives within the ReFi space. This document serves as a resource for understanding the impact and progress of regenerative finance, guiding future actions and strategies.  [Read the report](https://mirror.xyz/refidao.eth/773-LX8Jl5-Snk4lRVABzJTNXjnPgVcHjglPcvdInZY) \n    \n    ![The State of ReFi 2024 Report](https://i.imgur.com/S6uJyAD.png)\n\n- **ReFi DAO-ification:** The ReFi DAO-ification WG has been making significant progress in its efforts to enhance and redesign ReFi DAO’s Governance, Legal Framework, and Operations. We are well on the way towards launching ReFi DAO 2.0 - a new organisational structure that aims to foster autonomy and efficiency, with a range of specialised circles and working groups aligned towards our global mission.\n    \n    ![ReFi DAO-ification](https://i.imgur.com/g5xr944.png)\n\n- **Local Node Impact Tracking & Retroactive Funding:** ReFi DAO is actively experimenting with hypercerts for tracking impact across the global network of ReFi Local Nodes, and with an aim to channel resources towards those with the highest verifiable impact through a retroactive funding round. We are also exploring the potential for a custom hypercert minter tool to improve user experience (UX) and streamline the process for minting hypercerts across all Local Nodes, enabling a decentralized and transparent approach to contribution and impact tracking of Local Nodes.\n    \n    ![Impact Tracking](https://i.imgur.com/EgGte9r.png)\n\n# **Background & Origins**\n\nReFi DAO emerged as a founder-led startup community during the rapid influx of talent & capital that emerged in the 2021 ReFi boom. Since then, and thanks to the support of our community, we have become the cultural home of ReFi for top founders, investors and builders at the intersection of impact and web3. We are here to support the mycelial growth of regenerative culture, technology and ventures, both online and in-person. So far, we’ve enabled more than 100 events hosted in 58 cities, reached over 80k+ listeners on ReFi Podcast, served over 300 entrepreneurs and deployed over $55k in grant capital to Local Nodes via Gitcoin.\n\n![ReFi DAO Emergence](https://i.imgur.com/Bq3Wjei.png)\n\n### **What are ReFi Local Nodes? 🗺**\n\nConnected by an online community, and enabled by the most powerful tools of our time—Local Nodes bring the physical and digital world together into a symphony of inner and outer regeneration. They are for founders conducting radical experiments to unlock a regenerative economy at scale, they’re for leaders of public, private and third-sector institutions, and they’re for anyone committed to taking action, building community, and making the world a better place.\n\n![What is a ReFi Local Node?](https://i.imgur.com/IhDphAU.jpeg)\n\nOne node at a time, we aim to create an interconnected, self-sustaining world, where technology and humanity walk hand in hand towards regeneration. You can browse through the list of existing Local Nodes at **[refidao.com/community/local](https://www.refidao.com/community/local)**. For an overview of the impact created by the local Node Network in 2023, check out this post: **[Regenerative Journeys: ReFi Local Nodes 2023 Roundup](https://mirror.xyz/refidao.eth/pzwS5ape0Zqu5mnqKM60eIqMfBtLjQ18UEy1jiDeAHU)**. \n\n\n\nWe're proud to be supporting a global network of founders, investors, and community builders who are using the power of decentralized technologies to solve the most pressing challenges of our time.\n\n# 🌱 ReFi DAO Global 2025 Milestones\n\n- **Regen Coordination Impact Data Commons**  \n  ReFi DAO is developing and piloting a scalable impact tracking and measurement system across the ecosystem, leveraging the Common Impact Data Standard (CIDS) and integrating Web3 tools such as Hypercerts, Ethereum Attestation Service (EAS), and Karma GAP. This initiative is support projects including Local Nodes, GreenPill Chapters, and bioregional initiatives, and involve collaborations with partners like MetaGov and DAOStar to position the system as a DAOIP standard. The goal is to establish transparent, data-driven coordination for the regenerative movement.\n\n![Regen Coordination Impact Data Common Approach](https://europe1.discourse-cdn.com/flex005/uploads/octant/optimized/1X/7024a3513ec210b3d244486c7c1e4638b71ee27b_2_1380x776.jpeg)\n\n- **Regen Coordination Local ReFi Toolkit**  \n  Building on the success of the original Local Node Toolkit, ReFi DAO is devloping an enhanced version designed to serve a broader range of decentralized communities within Regen Coordination. This toolkit will feature updated playbooks, case studies, guides, and graphic assets co-created with networks like GreenPill Local Chapters, Celo Regional Hubs, Open Civics, BioFi Project, and Regens Unite. It will be a shared, practical resource that empowers local action, supports mutual learning, and accelerates ecosystem-wide innovation.\n\n ![Regen Coordination Local ReFi Toolkit](https://europe1.discourse-cdn.com/flex005/uploads/octant/original/1X/35041229cb4ccac0efdfc63996b66691f7e5a387.jpeg)\n\n- **Prosperity Passport Launch and Expansion**  \n  ReFi DAO is collaborating with Celo Public Goods to launch the Prosperity Passport—an on-chain identity and reputation system that includes the ReFi DAO Badge to recognize contributors across the ecosystem. The system will track participation from podcast guests and blog writers to event attendees and Local Node leaders, and expand to include other ReFi projects like EthicHub, ImpactMarket, and on-chain carbon initiatives. Workshops and onboarding resources will support adoption, helping build a trusted, interconnected network of regenerative actors.\n\n ![Prosperity Passport](https://europe1.discourse-cdn.com/flex005/uploads/octant/original/1X/bbdcb7a1beee6e0d110cd65a9df6fadb1271700e.jpeg)\n\n- **ReFi DAO 2.0 Launch**  \n  ReFi DAO will deliver a comprehensive upgrade to its operating system through the launch of ReFi DAO 2.0, including new governance, identity, impact, and coordination infrastructure. This milestone will see the rollout of foundational documentation like the ReFi DAO Constitution and Local Node Charter, alongside the integration of tools like the Impact Data Commons and Prosperity Passport. A key focus will be scaling community participation and coherence through bounties, localized onboarding resources, and streamlined tooling—laying the foundation for long-term sustainability and global impact.\n\n ![ReFi DAO Network Nation](https://europe1.discourse-cdn.com/flex005/uploads/octant/original/1X/7f5639744015099537a1a0fa0f9c5ef6a0b9358a.jpeg)\n\n# **Core Stewards**\n\n**Monty (Merlin) Bryant** ([Linktree](https://linktr.ee/montybryant)) - Founder at ReFi DAO, board member at [Trusted Seed](https://trustedseed.org/) , steward at [Celo Public Goods](https://celopg.eco/) . TEDx speaker ‘[Can Crypto Regenerate the World](https://www.youtube.com/watch?v=9-4HW3iPtfo&ab_channel=TEDxTalks).\n\n**Luiz Fernando** ([Twitter](https://twitter.com/louizfe)) - Founder & lead of [ReFi Barcelona](https://publish.obsidian.md/refi-barcelona), gardener at [Trusted Seed](https://trustedseed.org/), operations at ReFi DAO.\n\n**Raam Chandrasekharan** - DAO Relations & Blockchain Consultant. Raam is currently DAO Relations at Arbitrum Foundation and previously served as Senior Blockchain Consultant at Deloitte. He has extensive experience in Web3 governance and played a key role in the World Economic Forum Crypto Sustainability Coalition. Raam contributes to the strategic development and expansion of ReFi DAO’s initiatives.\n\n# The Future is Regenerative. Come Join! ✨\n\nReFi DAO stands at the forefront of combining technology with ecological finance to create a sustainable future. By supporting our initiative, you're investing in a resilient, equitable, and environmentally conscious economic system. Join us in this regenerative journey by engaging with our [Blog](https://blog.refidao.com/#/portal/signup), [Podcast](https://open.spotify.com/show/5RTHF6JVgQL1cgaVfvi7cv), or by becoming an active participant in our Telegram community. Let's build a regenerative future together.\n\n ![Regen Coordination Resources & Flows](https://europe1.discourse-cdn.com/flex005/uploads/octant/original/1X/a6682e25839554387f8e4014428ef060c5615ece.jpeg)\n\n## **Project Links & Resources**\n\n[Twitter](https://twitter.com/refidaoist), [LinkedIn](https://www.linkedin.com/company/refi-dao/), [Youtube](https://www.youtube.com/@refidao), [Blog](https://blog.refidao.com/#/portal/signup), [Podcast](https://twitter.com/ReFiPodcast) \n\n![Thank you!](https://i.imgur.com/8dTcI8z.jpeg)",
        "lastUpdated": 0,
        "projectTwitter": "ReFiDAOist"
      },
      "recipient": "0x7340F1a1e4e38F43d2FCC85cdb2b764de36B40c0"
    }
  },
  "status": "APPROVED",
  "project": {
    "metadata": {
      "type": "project",
      "canonical": {
        "chainId": 42161,
        "registryAddress": "0x4AAcca72145e1dF2aeC137E1f3C5E3D75DB8b5f3"
      }
    }
  }
}