{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-50361790304298892592579441899901695295488",
          "metadata": {
            "name": "Tree Planting at ReFi Week 2023!",
            "description": "ReFi Week at The Traditional Dream Factory (TDF) was a bold experiment in regenerative collaboration. Organized by ReFi DAO Global in partnership with Regens Unite, Bankless DAO, ReFi Lisboa, Treegens, dMeter, Silvi Protocol, Crypto Commons Association, and others, this week-long event brought together over 40 participants from around the world to regenerate the local ecosystem, deepen community, and prototype the future of decentralized finance for planetary healing. \n\n## Community Involvement \nSet in the regenerative village of TDF in Portugal, ReFi Week offered a hands-on, immersive experience rooted in co-living, permaculture, and shared learning. Community members, including Web3 builders, regenerative farmers, digital artists, and local residents, participated in collaboration to plant trees, explore ecological outcomes measurement approaches, and ideate systems for long-term regenerative funding using tools like Hypercerts and Gitcoin. The diversity of participants fostered a fertile ground for interdisciplinary innovation and cultural exchange. \n\n## Scale & Impact \nThe project took place on 7 hectares of land at TDF, a site dedicated to long-term ecological restoration and regenerative living. Over the course of ReFi Week, 700 trees were planted with the support of 40 volunteers. This effort was part of a broader initiative to plant 1,000 trees, sponsored by Silvi Protocol. The environmental interventions here aim to restore biodiversity, enhance carbon sequestration, regenerate degraded soils and contribute to a thriving food forrest with adaptive agroforestry. \n\n## Activities & Approach \nThe planting process was supported by Silvi's decentralized Measurement, Reporting, and Verification (dMRV) technology, leveraging mobile and drone-based ground-truthing tools to create \"genesis claims\" on-chain. These claims provide verifiable records of ecological restoration, laying the groundwork for future impact-linked funding mechanisms. The project also explored the use of the Ecological Benefits Framework (EBF) to assess and eventually quantify impact across multiple dimensions: air quality, water conservation, biodiversity, equity, and carbon drawdown. Participants explored the intersection of ecology, Web3, and public goods—hosting strategy sessions on the use of Hypercerts for capturing and funding impact, as well as engaging in storytelling and digital media creation to amplify the message of regeneration. \n\n## Quantifiable Results \n- 700 trees planted across a 7-hectare site \n- 40+ participants from 10+ countries directly engaged \n- Deployment of Silvi's dMRV system at TDF, with genesis claims minted on-chain \n- New prototypes for Hypercerts and Gitcoin-based funding models discussed and seeded \n\n## Lets Grow\nReFi Week demonstrated the power of place-based regenerative action combined with digital coordination tools to scale trust, transparency, and collaboration. It marks a step towards building a new regenerative economy—one where ecological integrity, community resilience, and decentralized innovation come together to heal our planet.\n"
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744125757",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://blog.refidao.com/regeneration-at-refi-week/\"}",
                    "{\"type\":\"url\",\"src\":\"https://ipfs.io/ipfs/bafkreifldrmri52bl6lr6uwr7lqhide7xopsuq7tledldfkza6ihitcgwe\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "50361790304298892592579441899901695295488",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "7bd56f17-3c37-45c6-8a46-08c9b4537766"
              }
            ]
          }
        }
      ]
    }
  }
}