{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-46278401901247631031018946610720476758016",
          "metadata": {
            "name": "Science-Based Assessment of Mangrove Restoration Potential in Capalonga",
            "description": "Wovoka Philippines, in partnership with the Capalonga Mangrove Development Association (CAMADA), is implementing the 1H2Inspire1000 project to restore degraded fishponds in Capalonga, Camarines Norte, with mangroves, running from June 2025 to June 2028. Prior to project implementation, a feasibility assessment was conducted to ensure ecological suitability and community readiness. This included measuring diameter at breast height (DBH), canopy height, and community structure; monitoring water levels; interviewing community members; documenting past planting projects; and checking the current status of existing mangroves. The community took geotagged photos using smartphones to support data collection. Abandoned and active fishponds were delineated using Google Earth Engine and later validated on the ground. Your support will help scale this science-backed, community-driven approach to safeguard the coast and strengthen the resilience of communities in Camarines Norte, which faces frequent typhoons and is highly vulnerable to storm surges."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744121000",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/folders/1IO0jAzu8Jm55hxQ3ya1ZM8L5D0WZ9I_e?usp=drive_link\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "46278401901247631031018946610720476758016",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "14b9d196-a40c-4054-8e88-23dc6ee70a6a"
              }
            ]
          }
        }
      ]
    }
  }
}