{
  "id": "25",
  "chainId": 42220,
  "roundId": "35",
  "projectId": "0xa2eee543241bf4b471ef9f465e9bf68ccf538da218be2ea1413919cbe242fdd1",
  "metadata": {
    "signature": "0x3fdfd4f9d091b47794ea65abc27b18a6218dfd2eae8b21f34ad8f9d8463fc565069bec1ae57c424ee4c944b23b27c3fd8aa4b9938b88d501f644878626e71ef41c",
    "application": {
      "round": "0xd1DBAE8f44ac7798B6eE3Eb739828ccc9eDb8EBB",
      "answers": [],
      "project": {
        "id": "0xa2eee543241bf4b471ef9f465e9bf68ccf538da218be2ea1413919cbe242fdd1",
        "title": "Green Planet Conservation Initiative",
        "logoImg": "bafkreidowatfc2rrslsffnpbhybzwyprfldzdv5hb4jrtj7gjj2z43s27u",
        "metaPtr": {
          "pointer": "bafkreicivh6erwdgffod3nt55rr6jwkzwvpclud6xmijyaskrjlygizodq",
          "protocol": "undefined"
        },
        "website": "https://gpci.com",
        "bannerImg": "bafybeiefwkukufxe4k5xrtq44cx4u2hbs3v7j4sr4njfxenbbfhp52losi",
        "createdAt": 1722470229207,
        "userGithub": "Eddydon850",
        "credentials": {
          "twitter": {
            "type": [
              "VerifiableCredential"
            ],
            "proof": {
              "jws": "eyJhbGciOiJFZERTQSIsImNyaXQiOlsiYjY0Il0sImI2NCI6ZmFsc2V9..Fk9iAYD0WqycMfmpGGWwMmItSJZiku53IzXSRWJcDPexJCbzF_sZDzYWdSHduO1ZXIfx-dKGIPY8wpRyPX6GCw",
              "type": "Ed25519Signature2018",
              "created": "2024-07-31T23:56:21.838Z",
              "proofPurpose": "assertionMethod",
              "verificationMethod": "did:key:z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC#z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC"
            },
            "issuer": "did:key:z6MkghvGHLobLEdj1bgRLhS4LPGJAvbMA1tn2zcRyqmYU5LC",
            "@context": [
              "https://www.w3.org/2018/credentials/v1"
            ],
            "issuanceDate": "2024-07-31T23:56:21.838Z",
            "expirationDate": "2024-10-29T23:56:21.838Z",
            "credentialSubject": {
              "id": "did:pkh:eip155:1:0x8efE51753dEfd7A1A82458731fbc05Fa04Cb2d1e",
              "hash": "v0.0.0:kWJDXnagiXNFxtWDEjgEKoRHROsshoy6DK0PP/cqND8=",
              "@context": [
                {
                  "hash": "https://schema.org/Text",
                  "provider": "https://schema.org/Text"
                }
              ],
              "provider": "ClearTextTwitter#GreenPlane49148"
            }
          }
        },
        "description": " 🌍 The Challenge We’re Tackling\n\nIn the heart of Northern Nigeria, forests are vanishing at an alarming rate. Every day, trees are cut down to meet the basic needs of food, fuel, medicine, and timber. But the cost of this necessity is growing dangerously high. The region is now at the forefront of one of the most severe environmental crises in Africa — deforestation.\nThe impacts are already devastating: unpredictable rainfall patterns, rising temperatures, and extreme weather events like wind erosion are becoming the norm. These environmental changes are triggering cascading effects—soils are degrading, farmland is turning to desert, biodiversity is vanishing, and entire ecosystems are collapsing. Landslides are more frequent, and desertification is creeping into once fertile lands, displacing farmers and threatening food security.\nAccording to the United Nations, Nigeria leads the world in deforestation, losing an estimated 3.7% of its forests annually. This rapid loss is occurring in a country that holds Africa’s largest mangrove forest, of which only 6% is currently protected. The multiple ecological zones that once supported diverse livelihoods and agricultural practices are now under serious threat from climate change and environmental shocks.\nIf we do nothing, millions of people in this region face a future marked by poverty, hunger, and migration. Communities that once thrived will be forced to abandon their ancestral lands. The environmental degradation will continue to accelerate, contributing to global climate change and deepening socio-economic instability.\n\n\n 📜 Our Solution\n\nGreen Planet Conservation Initiative (GPCI), is a non-governmental organization championing environmental conservation, sustainable practices, and climate education. We’re actively restoring degraded ecosystems through agroforestry, reforestation, regenerative agriculture, and biodiversity protection, with a strong focus on climate education in schools and grassroots community engagement.\n\nAt GPCI, we believe that the path to climate resilience and environmental restoration lies in empowering communities and nurturing the next generation of eco-leaders. Our comprehensive Green Project Initiative directly addresses the urgent environmental crisis in Northern Nigeria—deforestation, land degradation, biodiversity loss, and climate vulnerability—through a bold, multifaceted strategy.\n\nOur Green Project Initiative has been making remarkable impact in the following areas:\n\n- we plant trees in schools and communities, restoring degraded land, improving air quality, and promoting biodiversity.  By integrating agroforestry, we help farmers cultivate sustainable tree-crop systems that enhance food security while capturing carbon.\n\n- Education is a powerful tool in the fight against climate change. GPCI conducts climate awareness campaigns in schools and local communities to enlighten young people about environmental conservation. By engaging students in interactive learning sessions and tree-planting exercises, we foster a generation that understands the urgency of climate action.\n\n- GPCI advocates for Regenerative Agriculture, training farmers on eco-friendly farming practices such as cover cropping, crop rotation, composting, and water-efficient irrigation.\n\n- In collaboration with the Federal College of Forestry, we’re working to protect Pterocarpus erinaceus (African Rosewood), an endangered native species threatened by over-exploitation. Our preservation efforts not only protect this keystone species but help maintain the ecological balance in its native habitat.\n\n- We integrate Digital Measurement, Reporting, and Verification (DMRV) technologies using Web3 to track the impact of our tree-planting and land restoration projects. By leveraging blockchain-based solutions, we ensure transparency, accountability, and data integrity in climate action efforts, making it easier to measure progress and attract funding.\n\n- Many vulnerable communities suffer the most from climate change due to poor access to resources. GPCI bridges this gap by providing knowledge, tools, and sustainable livelihood options. Our initiatives create opportunities for local farmers, students, and youth, empowering them to become active participants in environmental conservation.\n\n\n\n\n🖼️ See Our Impact\n\n\n![image](https://www.ecocertain.xyz/_next/image?url=%2Fapi%2Fhypercert-image%2F42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-54785461074271092617603311796514682044416&w=384&q=75)\n\n🔗 [Our Hypercert](https://www.ecocertain.xyz/hypercert/42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-54785461074271092617603311796514682044416)\n\n📝 What This Hypercert Represents:\n\nGreen Planet Conservation Initiative (GPCI) is driving transformative impact across communities through bold climate action and education. To date, GPCI has successfully planted over 1,500 trees across various schools, reinforcing its commitment to environmental restoration and youth engagement. In a landmark community event, the organization distributed 500 tree seedlings in a single day, empowering hundreds of participants to join in reforestation efforts.\nGPCI proudly hosted a flag-off climate action program with over 1,000 attendees, including students, educators, government officials, and environmental experts—marking a significant milestone in public awareness and mobilization. Through its innovative school outreach, GPCI has trained 250 students as Tree Ambassadors, equipping them with practical skills and leadership tools to champion sustainability within their schools and communities.\nThe initiative has further extended its reach by delivering climate education to over 15,000 students across many schools, fostering a new generation of eco-conscious leaders. To ensure transparency and accountability in its restoration efforts, GPCI has also integrated dMRV (Digital Monitoring, Reporting, and Verification) tools—specifically the Silvi Protocol—to digitally track tree planting activities, demonstrating a forward-thinking approach that blends environmental action with Web3 technology.\nBy combining hands-on restoration, climate education, and technological innovation, our initiative doesn’t just plant trees—it cultivates environmental stewards, strengthens community resilience, and creates a ripple effect of sustainable practices across Northern Nigeria.\nWe’re not just responding to a crisis—we’re building a greener, more sustainable future for generations to come.\n\n\n ✅ Proof That It’s Working\n\nThe Live pictures from our events are proof to our on the ground impact and this can be viewed on our x- page(formerly Twitter) and google drive link\nhttps://x.com/GreenPlane49148\n![alt text](https://pbs.twimg.com/media/GlYLJEwXoAAkRN2?format=jpg&name=4096x4096)\n\nA testimonial from our flag off event\n\nProf. Obed Goselle (Commissioner for Science and innovation): “GPCI’s innovative approach to sustainability education and tree planting is a model for others to follow.”\nhttps://youtu.be/Vk57RdT9Fqk\n\n\n📂 [See the Proof of Impact](https://drive.google.com/drive/folders/162Y7OCgHR7UZaEnPjpQXOuRc7dTHcUbZ?usp=drive_link)\n\n💡 Join Us in Making a Difference!\n\nThe environmental crisis in Northern Nigeria is not a distant threat—it’s happening now, and its impact is being felt by vulnerable communities, children, and ecosystems every single day. But together, we can rewrite the story.\nYour support can restore forests, educate future climate leaders, and protect endangered species.\nEvery dollar you give helps us plant more trees, train more students, digitize our impact through dMRV, and scale our work to reach the communities that need it most. It helps us bring life back to the land and hope to the people.\n🌱 Donate today to support tree planting, climate education, and environmental restoration and it will create a more sustainable future for the next generation.\nLet’s turn the tide of deforestation, one tree, one student, one community at a time.",
        "lastUpdated": 0,
        "projectGithub": "Green planet conservation initiative",
        "projectTwitter": "GreenPlane49148"
      },
      "recipient": "0x8efE51753dEfd7A1A82458731fbc05Fa04Cb2d1e"
    }
  },
  "status": "APPROVED",
  "project": {
    "metadata": {
      "type": "project",
      "canonical": {
        "chainId": 42161,
        "registryAddress": "0x4AAcca72145e1dF2aeC137E1f3C5E3D75DB8b5f3"
      }
    }
  }
}