{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-54785461074271092617603311796514682044416",
          "metadata": {
            "name": "Climate Education and Tree Planting in Nigeria",
            "description": "The Green Planet Conservation Initiative (GPCI) is driving transformative impact across communities through bold climate action and education. To date, GPCI has successfully planted over 1,500 trees across various schools, reinforcing its commitment to environmental restoration and youth engagement. In a landmark community event, the organization distributed 500 tree seedlings in a single day, empowering hundreds of participants to join in reforestation efforts.GPCI proudly hosted a flagship climate action program with over 1,000 attendees, including students, educators, government officials, and environmental experts—marking a significant milestone in public awareness and mobilization. Through its innovative school outreach, GPCI has trained 250 students as Tree Ambassadors, equipping them with practical skills and leadership tools to champion sustainability within their schools and communities.The initiative has further extended its reach by delivering climate education to over 15,000 students across many schools, fostering a new generation of eco-conscious leaders. To ensure transparency and accountability in its restoration efforts, GPCI has also integrated dMRV (Digital Monitoring, Reporting, and Verification) tools—specifically the Silvi Protocol—to digitally track tree planting activities, demonstrating a forward-thinking approach that blends environmental action with Web3 technology."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744125238",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://x.com/GreenPlane49148\"}",
                    "{\"type\":\"url\",\"src\":\"https://www.youtube.com/watch?v=Vk57RdT9Fqk\"}",
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/folders/162Y7OCgHR7UZaEnPjpQXOuRc7dTHcUbZ\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "54785461074271092617603311796514682044416",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "9d141fa1-77e7-42b8-b42a-7217ddac130b"
              }
            ]
          }
        }
      ]
    }
  }
}