{
  "data": {
    "hypercerts": {
      "count": 2,
      "data": [
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-18638626365727483397742880747467672014290944",
          "metadata": {
            "name": "ReFi Mexico               Web3 for Good       Impact-Driven Adoption",
            "description": "ReFi Mexico is educating people from the fields on how to access Web3. We have been organizing events and growing the Regenerative Community, we organize Reforestation events, Waterfall cleanups, Social Impact innitiatives."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "42161-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-8507059173023461586584365185794205286400",
          "metadata": {
            "name": "ReFi Mexico City",
            "description": "ReFi Mexico es un nodo local de ReFi DAO dedicado a empoderar a constructores y emprendedores con tecnología Web 3.0 y Blockchain. Tras un año de construcción comunitaria, estamos desarrollando un NFT Minter de impacto y su literatura que evolucionará a un mercado de impacto, permitiendo tokenizar y comercializar el impacto de las comunidades.\n\nAyudamos a proyectos con metodologías de desarrollo, integración de tecnología Web 3.0, consultorías para acceder a mecanismos de fondeo descentralizado y asesorías para uso de marcos de acción en relación a impacto Social / Ambiental. Estamos creando una herramienta de código abierto con literatura y marcos de referencia que sirven como contribución al estado del arte de las criptoeconomías regenerativas.\n\nEstamos construyendo una plataforma de código abierto para que cualquier comunidad pueda generar trazabilidad de su impacto de manera sencilla, accediendo a mecanismos alternativos de financiamiento basados en Web 3.0 mientras generamos un mapeo y onboarding de stakeholders importantes. Creamos literatura sobre economía regenerativa en inglés y español, Hemos Co-organizamos más de 12 eventos educativos y recreativos."
          },
          "attestations": {
            "data": []
          }
        }
      ]
    }
  }
}