{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-53764613973508277227213187974219377410048",
          "metadata": {
            "name": "Adopt A Tree in Kenya",
            "description": "The Adopt a Tree initiative is a climate education and tree-planting project targeting school children and communities in Bungoma and Kakamega Counties, Western Kenya. It aims to instill environmental stewardship in children while promoting agroforestry practices among farmers to enhance food security, biodiversity, and climate resilience. By integrating trees with food crops, the project contributes to carbon sequestration, soil restoration, and sustainable livelihoods. In the past one year, we have been able to train more than 300 learners on planting and taking care of trees. Each has adopted 2 trees. This has enabled us to plant more than 700 trees in  diferent sites. We are moving to integrating this with agroforestry so as to include the communitues around the schools in planting trees together with their crops, this will lead to increased food security, soil restoration and sustainable livelihoods. Your donation to the Adopt a Tree project supports climate action, environmental education, food security, and community resilience—all in one initiative. It’s a chance to make a tangible, lasting difference in people’s lives and the planet’s future."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744123935",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://gap.karmahq.xyz/project/adopt-a-tree/impact\"}",
                    "{\"type\":\"url\",\"src\":\"https://map.treetracker.org/planters/17737?bounds=34.66846990690101,0.4070952755410336,34.68494939908851,0.42087074142007297\"}",
                    "{\"type\":\"url\",\"src\":\"https://docs.google.com/document/d/1e0dStTv0tqS6DYFBaH4mo-1n8LNTxB4gjCx9A2BEwx8\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "53764613973508277227213187974219377410048",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "36d72ac4-7c83-49ca-b149-c587238ad20a"
              }
            ]
          }
        }
      ]
    }
  }
}