{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-55125743441192031081066686403946450255872",
          "metadata": {
            "name": "Unlocking Access to Finance for Kenyan Coffee Farmers",
            "description": "Community Involvement\nProject Mocha empowers over 700,000 smallholder coffee farmers in Kenya by integrating their assets into a blockchain-based ecosystem. Farmers actively participate by geo-tagging their coffee trees, contributing productivity data through IoT sensors, and receiving direct financial incentives tied to their output. This engagement ensures traceability, transparency, and fair pricing, addressing exploitation by intermediaries and financial exclusion.\n\nScale & Impact\nThe project operates in Kenya, targeting smallholder farmers who collectively produce high-quality Arabica coffee. Phase 1 (2025) begins with 2,000 trees. The initiative aims to increase productivity from the current average of 0.2 kg/tree to 1–2.5 kg/tree, potentially boosting coffee output by over 300%. This transformation could benefit millions in coffee-growing communities while creating a sustainable financial ecosystem.\n\nActivities & Approach\nProject Mocha tokenizes coffee trees and beans via blockchain technology. Farmers receive Mocha Bean Tokens (MBTs) backed by their coffee output, enabling access to on-chain liquidity for farm rehabilitation and productivity investments. Activities include:\n\nGeo-tagging trees for proof of reserves.\n\nApplying modern agronomic practices like fertilization, pest management, and irrigation.\n\nImplementing climate-smart agroforestry techniques to enhance biodiversity and carbon sequestration.\nThese actions are vital for increasing yields, mitigating climate risks, and ensuring long-term sustainability.\n\nQuantifiable Results\n\nHectares Restored: Thousands of hectares will be rehabilitated through improved soil health and tree rejuvenation practices.\n\nPeople Impacted: Over 700,000 farmers benefit directly from financial inclusion and productivity gains.\n\nSpecies Protected: Agroforestry practices promote biodiversity by intercropping coffee with shade trees.\n\nEconomic Outcomes: Farmers' income increases through direct market access and elimination of exploitative intermediaries. Productivity is projected to rise by over 300%, generating significant economic value for Kenya's coffee industry.\n\nCompelling Benefits\nProject Mocha revolutionizes coffee farming by bridging the gap between farmers and global markets. It fosters financial inclusion, enhances productivity, mitigates climate risks, and ensures fair compensation for farmers—all while offering investors exposure to a real-world commodity. By leveraging blockchain technology, the project creates a transparent and sustainable model that benefits both nature and the community"
          },
          "attestations": {
            "data": [
              {
                "attester": "0xEf48752C933b1050187e89A9F909De2b9e0BDCE6",
                "creation_block_timestamp": "1743959830",
                "data": {
                  "tags": [
                    "gainforest",
                    "gitcoin",
                    "gg23"
                  ],
                  "chain_id": 42220,
                  "comments": "We verify this project for Gitcoin GG23.",
                  "token_id": "55125743441192031081066686403946450255872",
                  "evaluate_work": 1,
                  "evaluate_basic": 1,
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959",
                  "evaluate_properties": 1,
                  "evaluate_contributors": 1
                },
                "id": "1658c2c6-142a-421e-ace2-06469896dfd0"
              },
              {
                "attester": "0x1eF170D53C54470FD0fd27619A54b42da6F4E0F4",
                "creation_block_timestamp": "1744123723",
                "data": {
                  "title": "GG23: Hypercerts for Nature Stewards ",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://drive.google.com/drive/folders/1a0hXZTYnEmWOtXUA2JOVwk2cDszHV9Y3\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "55125743441192031081066686403946450255872",
                  "description": "Proof of impact links found for this ecocert in the \"Hypercerts for Nature Stewards\" GG23 funding round.\n\nData: Phase 1 has geo-tagged 2,000 trees with IoT sensors tracking productivity, Images and videos of farm activities.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "3c26dd0d-df3f-4cf8-b4c5-8ed9cd719e53"
              }
            ]
          }
        }
      ]
    }
  }
}