{
  "data": {
    "hypercerts": {
      "count": 1,
      "data": [
        {
          "hypercert_id": "42220-0x16bA53B74c234C870c61EFC04cD418B8f2865959-58528567110401415715700432478264132370432",
          "metadata": {
            "name": "Kimmi Restoration Campaign at Kimmi Island",
            "description": "The Kimi Restoration Campaign is a community-led initiative on Kimi Island, Uganda, addressing the challenges faced by its approximately 5,500 residents in Kimi Kachanga and Kimi Banga. Prompted by inadequate infrastructure, limited healthcare, environmental degradation, and the aftermath of a 2017 fire, the campaign adopts a multi-faceted approach with active participation from local leaders and residents. Spearheaded by the Green Ambassadors Club and other partners, the initiative prioritizes youth empowerment through skill development to enhance livelihoods and healthcare access. Key focus areas include environmental conservation and sustainable livelihoods, with youth training in soap making and crafting reusable sanitary towels to reduce reliance on the mainland and create local jobs. Healthcare improvement involves installing a solar-powered system at the clinic for proper medicine storage, advocating for a stationed nurse, and organizing medical camps, one recently serving 1,500 residents. The campaign also focuses on renewable energy and clean lighting by distributing solar lamps to students and families, and on hygiene and sanitation through the construction of additional restrooms near schools and the clinic.\nThe campaign has already achieved tangible impact by training 500 youth and single mothers in skills like soap and Vaseline making and providing food and clothing to vulnerable families. By emphasizing local ownership and capacity building, the Kimi Restoration Campaign is committed to fostering a healthier, more self-reliant, and environmentally conscious community."
          },
          "attestations": {
            "data": [
              {
                "attester": "0x87f64272eB089a14dc5764B848E3488710b829EA",
                "creation_block_timestamp": "1745926832",
                "data": {
                  "title": "Photos from the events",
                  "sources": [
                    "{\"type\":\"url\",\"src\":\"https://photos.google.com/share/AF1QipOWD-WIBL-5KHhfcFM6HmVNu7DShh11FoEiN-YIXMoga2IrciU0LzaZzV5uSMc51Q?key=T1J0NlhuUFZ5M0pLLW1neWx3cXAyLXdaVWo0ZVBB\"}"
                  ],
                  "chain_id": 42220,
                  "token_id": "58528567110401415715700432478264132370432",
                  "description": "This folder showcases photos from key events held as part of the Kimi Restoration Campaign. From skills training sessions and solar lamp distribution to community health camps and sanitation improvements, these images capture the impact of the campaign on the ground.",
                  "contract_address": "0x16bA53B74c234C870c61EFC04cD418B8f2865959"
                },
                "id": "d0ba5748-66b5-435d-813c-4a3a029347e1"
              }
            ]
          }
        }
      ]
    }
  }
}