{
  "data": {
    "hypercerts": {
      "count": 5,
      "data": [
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-116036287120040016041010741134232960106496",
          "metadata": {
            "name": "Decentralized Library",
            "description": "The need to implement more Web2 solutions into Web3 has necessitated this idea. Decentralized library is a no-censorship library where users go to read books and watch video books using the Web3 wallet.\n\nThe following benefit awaits users of this project\n\nHundreds of Academic E-Books: The Library has more books than you could imagine. E-books repositories are decentralized (IPFS Storage).\nLot of Video-Books: The full video books are here for you. if you cannot read the ebook format, you can read you favorite textbooks by watching them (IPFS Storage).\nNo Political Censorship: No fear from the government of your country not allowing certain books. You can read or watch them here.\nLearn and Earn: The very First decentralized Library where you LEARN and EARN.\nLive Class Streaming: Lecturers / Teachers can use this platform to schedule live teaching and learning. just contact us\nNo Loss of Books: Prevent the accidental or intentional loss of information from human consciousness\n"
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-169120336359706416341297179893588801093632",
          "metadata": {
            "name": "Decentralized Library",
            "description": "Project Decentralized Library is an open source protocol for providing access to hundreds of academic e-books, video-books, and live class streaming with no political censorship and no loss of books."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-230030880038554401301241234623875310944256",
          "metadata": {
            "name": "Infinite Garden Library",
            "description": "The Infinite Garden project is creating a library of uplifting mythology and inspiring stories to guide new crypto users, increase public goods awareness in the NFT space, and celebrate the web3 adventure."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-7715902669932279659032019223515344194764800",
          "metadata": {
            "name": "WATERY LIBRARY",
            "description": "The Watery Library is a unique concept that combines the serenity of a library with the soothing presence of water. Discover the enchanting experience and services offered at the Watery Library."
          },
          "attestations": {
            "data": []
          }
        },
        {
          "hypercert_id": "10-0x822F17A9A5EeCFd66dBAFf7946a8071C265D1d07-13645322913529632384881321758013905279385600",
          "metadata": {
            "name": "Local Library Digitization",
            "description": "Digitize the town library's collection of over 10,000 books, periodicals, and manuscripts, making them accessible online and ensuring the preservation of cultural heritage"
          },
          "attestations": {
            "data": []
          }
        }
      ]
    }
  }
}